<center>
<img src="https://itspresso.com/wp-content/uploads/2019/05/outsourcing-data-analysis.png" width="500" alt="cognitiveclass.ai logo"  />
</center>
<span class="border border-warning"></span>

In [1]:
#for mathematical computation
import pandas as pd
import numpy as np
import scipy.stats as stats
import datetime

#for data visualization

import seaborn as sns
import matplotlib.pyplot as plt
from matplotlib.pyplot import figure

# for API

import requests
from IPython.display import Image
from pandas.plotting import andrews_curves
%matplotlib inline

#To displa all the columns

pd.set_option('display.max_columns', None)

<div class="alert alert-info alertdanger" style="margin-top: 20px">
    <center>
<h1> Question: Between Winter and Summer which season has the most births </h1>
</div>

<div class="alert alert-info alertdanger" style="margin-top: 20px">

<b>Summer Months</b>
       

</div>

In [2]:
Summer_Pre_COVID_Births = pd.read_csv('../data/Pre COVID Birth(All States)/Summer_Pre_COVID_Births_(All States).csv')
Summer_Pre_COVID_Births.head()

FileNotFoundError: [Errno 2] No such file or directory: '../data/Pre COVID Birth(All States)/Summer_Pre_COVID_Births_(All States).csv'

In [5]:
Birth_months= Summer_Pre_COVID_Births.loc[(Summer_Pre_COVID_Births['Month']=='February')|(Summer_Pre_COVID_Births['Month']=='March')|(Summer_Pre_COVID_Births['Month']=='April')|(Summer_Pre_COVID_Births['Month']=='May')]
Birth_months.head()
#extract(Feb, March, April, May)

NameError: name 'Summer_Pre_COVID_Births' is not defined

In [4]:
Birth_year_mean = round(Birth_months.groupby('Year').mean()).reset_index().drop(columns=['Year Code','Month Code'])
Birth_year_mean.loc[[0],['Year']]=2017
Birth_year_mean.loc[[1],['Year']]=2018
Birth_year_mean.loc[[2],['Year']]=2019
Birth_year_mean

   Year    Births
0  2017  303907.0
1  2018  298962.0
2  2019  293124.0

# Write to csv

In [5]:
Birth_year_mean.to_csv('../data/Summer_Pre_COVID_Births_(All States).csv',index = False)

<div class="alert alert-info alertdanger" style="margin-top: 20px">
   <center>
<b>Winter Months</b>  

</div>

In [6]:
Winter_Pre_COVID_Births= pd.read_csv('../data/Pre COVID Birth(All States)/Winter_Pre_COVID_Births_(All States).csv')
Winter_Pre_COVID_Births.head()

   Year Year Code     Month  Month Code  Births
0  2017      2017   January         1.0  312839
1  2017      2017  February         2.0  288232
2  2017      2017     March         3.0  318659
3  2017      2017     April         4.0  299232
4  2017      2017       May         5.0  321526

In [7]:
Winter_Birth_months = Winter_Pre_COVID_Births.loc[(Winter_Pre_COVID_Births['Month']=='August')|(Winter_Pre_COVID_Births['Month']=='September')|(Winter_Pre_COVID_Births['Month']=='October')|(Winter_Pre_COVID_Births['Month']=='November')]
Winter_Birth_months.head()
#extracted the months ('August','September','October','November)

    Year Year Code      Month  Month Code  Births
7   2017      2017     August         8.0  351186
8   2017      2017  September         9.0  336298
9   2017      2017    October        10.0  328943
10  2017      2017   November        11.0  315559
20  2018      2018     August         8.0  343708

In [8]:
Winter_Birth_year_mean = round(Winter_Birth_months.groupby('Year').mean()).reset_index().drop(columns=['Month Code'])
Winter_Birth_year_mean

   Year    Births
0  2017  332996.0
1  2018  324792.0
2  2019  321706.0

In [9]:
Winter_Birth_year_mean['Diff']= Winter_Birth_year_mean['Births'].diff()

In [10]:
Winter_Birth_year_mean['Pct_change']= Winter_Birth_year_mean['Births'].pct_change()

In [11]:
Winter_Birth_year_mean

   Year    Births    Diff  Pct_change
0  2017  332996.0     NaN         NaN
1  2018  324792.0 -8204.0   -0.024637
2  2019  321706.0 -3086.0   -0.009501

# Write to CSV

In [12]:
Winter_Birth_year_mean.to_csv('../data/Winter_Pre_COVID_Births_(All States).csv', index = False) # Create a csv file of the Pre COVID winter births

# 2nd Part

<div class="alert alert-info alertdanger" style="margin-top: 20px">
    <center>
<h1> Question: Which States has the highest conception rate 
        
<h1>Determine which States to use to compare the Winter Births </h1>
</div>

<div class="alert alert-danger alertdanger" style="margin-top: 20px">
<b>Determine the Pre-COVID Avg Temp</b>
        </div>

In [13]:
Winter_2017 = pd.read_csv('../data/Weather/Winter_2017.csv',skiprows=3) #Dec 2016 - Feb 2017 Statewide Average Temperature
Winter_2018 = pd.read_csv('../data/Weather/Winter_2018.csv',skiprows=3) #Dec 2017 - Feb 2018 Statewide Average Temperature
Winter_2019 = pd.read_csv('../data/Weather/Winter_2019.csv',skiprows=3) #Dec 2018 - Feb 2019 Statewide Average Temperature
#https://www.ncdc.noaa.gov/cag/statewide/mapping

In [14]:
Winter_2017.head()

,Location ID,Location,Value,Rank,Anomaly (1901-2000 base period),1901-2000 Mean
0,100,Alabama,52.7,123,6.1,46.6
1,200,Arizona,45.5,119,3.2,42.3
2,300,Arkansas,46.7,125,5.4,41.3
3,400,California,44.3,75,0.7,43.6
4,500,Colorado,28.6,113,3.2,25.4

In [15]:
Winter_2017.rename(columns={'Value':'Temp_2017'},inplace=True)

In [16]:
Winter_2017 = Winter_2017[['Location ID','Location','Temp_2017']]
Winter_2017.head (1)

   Location ID Location  Temp_2017
0          100  Alabama       52.7

In [17]:
Winter_2018.rename(columns={'Value':'Temp_2018'},inplace=True)

In [18]:
Winter_2018 = Winter_2018[['Location ID','Location','Temp_2018']]

In [19]:
Winter_17_18 = pd.merge(Winter_2017,Winter_2018,how='inner',on = 'Location ID')

In [20]:
Winter_17_18.head(1)

   Location ID Location_x  Temp_2017 Location_y  Temp_2018
0          100    Alabama       52.7    Alabama       48.4

In [21]:
Winter_2019.rename(columns={'Value':'Temp_2019'},inplace=True)

In [22]:
Winter_2019.head(1)

,Location ID,Location,Temp_2019,Rank,Anomaly (1901-2000 base period),1901-2000 Mean
0,100,Alabama,50.5,116,4.0,46.5

In [23]:
Winter_17_18_19= pd.merge(Winter_17_18,Winter_2019,how='inner', on='Location ID')

In [24]:
Winter_17_18_19.head(2)

,Location ID,Location_x,Temp_2017,Location_y,Temp_2018,Location,Temp_2019,Rank,Anomaly (1901-2000 base period),1901-2000 Mean
0,100,Alabama,52.7,Alabama,48.4,Alabama,50.5,116,4.0,46.5
1,200,Arizona,45.5,Arizona,47.0,Arizona,42.0,43,-0.2,42.2

In [25]:
pre_covid_winter = Winter_17_18_19[['Location','Temp_2017','Temp_2018','Temp_2019']]

In [26]:
pre_covid_winter.head(1)

  Location  Temp_2017  Temp_2018  Temp_2019
0  Alabama       52.7       48.4       50.5

In [27]:
Temp_mean = round(pre_covid_winter.mean(axis=1),1)

In [28]:
pre_covid_winter['Avg_Temp']= Temp_mean  #Winter Temp for Pre_COVID W/ mean

<ipython-input-28-b3940ee4d5e0>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  pre_covid_winter['Avg_Temp']= Temp_mean  #Winter Temp for Pre_COVID W/ mean

In [29]:
pre_covid_winter.head(1)

  Location  Temp_2017  Temp_2018  Temp_2019  Avg_Temp
0  Alabama       52.7       48.4       50.5      50.5

In [30]:
coldest_states= pre_covid_winter.sort_values('Avg_Temp', ascending=True)

<div class="alert alert-info alertdanger" style="margin-top: 20px">
<b>Cooler Months</b>
        </div>

In [31]:
coldest_states.head(8)

        Location  Temp_2017  Temp_2018  Temp_2019  Avg_Temp
31  North Dakota       14.0       10.9        9.3      11.4
20     Minnesota       17.9       10.8       10.7      13.1
38  South Dakota       20.4       17.1       16.5      18.0
23       Montana       18.3       18.1       18.3      18.2
46     Wisconsin       22.4       16.2       17.2      18.6
16         Maine       20.9       18.0       16.9      18.6
47       Wyoming       20.4       22.7       20.1      21.1
42       Vermont       24.8       20.0       19.0      21.3

In [32]:
hot_states= round(pre_covid_winter.sort_values('Avg_Temp', ascending=False),1)

<div class="alert alert-info alertdanger" style="margin-top: 20px">
<b>Warmer Months</b>
        </div>

In [33]:
hot_states.head(8)

          Location  Temp_2017  Temp_2018  Temp_2019  Avg_Temp
7          Florida       64.7       62.0       62.6      63.1
15       Louisiana       57.7       51.8       53.4      54.3
8          Georgia       53.9       50.3       51.5      51.9
0          Alabama       52.7       48.4       50.5      50.5
21     Mississippi       53.1       48.0       50.1      50.4
40           Texas       52.9       48.0       49.1      50.0
37  South Carolina       52.0       48.6       49.4      50.0
3       California       44.3       47.7       43.8      45.3

In [34]:
# pre_covid_winter.to_csv('../data/pre_covid_winter.csv', index = False) # Create a csv file of the Pre COVID winter

<div class="alert alert-danger alertdanger" style="margin-top: 20px">
<b>Summer Months</b>
        </div>

In [35]:
Summer_2017 = pd.read_csv('../data/Weather/Summer_2017.csv',skiprows=3) #Jun 2017 - Aug 2017 Statewide Average Temperature
Summer_2018 = pd.read_csv('../data/Weather/Summer_2018.csv',skiprows=3) #Jun 2018 - Aug 2018 Statewide Average Temperature
Summer_2019 = pd.read_csv('../data/Weather/Summer_2019.csv',skiprows=3) #Jun 2019 - Aug 2019 Statewide Average Temperature

In [36]:
Summer_2017.head()

,Location ID,Location,Value,Rank,Anomaly (1901-2000 base period),1901-2000 Mean
0,100,Alabama,78.4,37,-0.5,78.9
1,200,Arizona,80.1,121,2.8,77.3
2,300,Arkansas,77.7,25,-1.1,78.8
3,400,California,76.5,126,4.3,72.2
4,500,Colorado,66.3,108,1.8,64.5

In [37]:
Summer_2017.rename(columns={'Value':'Temp_2017'},inplace=True)

In [38]:
Summer_2017 = Summer_2017[['Location ID','Location','Temp_2017']]
Summer_2017.head (1)

   Location ID Location  Temp_2017
0          100  Alabama       78.4

In [39]:
Summer_2018.rename(columns={'Value':'Temp_2018'},inplace=True)

In [40]:
Summer_2018 = Summer_2018[['Location ID','Location','Temp_2018']]

In [41]:
Summer_17_18 = pd.merge(Summer_2017,Summer_2018,how='inner',on = 'Location ID')

In [42]:
Summer_17_18.head(2)

   Location ID Location_x  Temp_2017 Location_y  Temp_2018
0          100    Alabama       78.4    Alabama       79.8
1          200    Arizona       80.1    Arizona       80.4

In [43]:
Summer_2019.rename(columns={'Value':'Temp_2019'},inplace=True)

In [44]:
Summer_17_18_19= pd.merge(Summer_17_18,Summer_2019,how='inner', on='Location ID')

In [45]:
pre_covid_Summer = Summer_17_18_19[['Location','Temp_2017','Temp_2018','Temp_2019']]

In [46]:
Summer_Temp_mean = pre_covid_Summer.mean(axis=1)

In [47]:
pre_covid_Summer['Summer_Avg_Temp']= round(Summer_Temp_mean,1)

<ipython-input-47-87643371dec1>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  pre_covid_Summer['Summer_Avg_Temp']= round(Summer_Temp_mean,1)

In [48]:
pre_covid_Summer.head() #Summer Temp for Pre_COVID W/ mean Temp

     Location  Temp_2017  Temp_2018  Temp_2019  Summer_Avg_Temp
0     Alabama       78.4       79.8       79.8             79.3
1     Arizona       80.1       80.4       79.7             80.1
2    Arkansas       77.7       80.2       78.3             78.7
3  California       76.5       75.8       74.5             75.6
4    Colorado       66.3       67.6       66.0             66.6

### Write to csv

In [49]:
#pre_covid_Summer.to_csv('../data/pre_covid_Summer.csv', index = False) # Create a csv file of the Pre COVID winter

<div class="alert alert-danger alertdanger" style="margin-top: 20px">
<b>Gather the Pre- COVID Population data for females between 15-44 years old</b>
        </div>

In [50]:
Alabama = pd.read_excel('../data/Population/Alabama.xlsx',skiprows=4)
Alabama.head()

,Age,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,4779736.0,2320188.0,2459548.0,4780125.0,2320477.0,2459648.0,4785437.0,2322988.0,2462449.0,4799069.0,2328254.0,2470815.0,4815588.0,2335710.0,2479878.0,4830081.0,2342422.0,2487659.0,4841799.0,2347092.0,2494707.0,4852347.0,2351634.0,2500713.0,4863525.0,2355599.0,2507926.0,4874486.0,2358683.0,2515803.0,4887681.0,2363320.0,2524361.0,4903185.0,2369517.0,2533668.0
1,Under 5 years,304957.0,155265.0,149692.0,304960.0,155267.0,149693.0,304257.0,155009.0,149248.0,302829.0,154601.0,148228.0,299235.0,152640.0,146595.0,294695.0,150157.0,144538.0,293559.0,149638.0,143921.0,293970.0,149790.0,144180.0,294209.0,149488.0,144721.0,294604.0,149678.0,144926.0,295295.0,150168.0,145127.0,294357.0,149715.0,144642.0
2,5 to 9 years,308229.0,157340.0,150889.0,308230.0,157342.0,150888.0,307242.0,156774.0,150468.0,304649.0,155264.0,149385.0,305676.0,155956.0,149720.0,306917.0,156531.0,150386.0,306192.0,156063.0,150129.0,305120.0,155361.0,149759.0,303861.0,154940.0,148921.0,301248.0,153488.0,147760.0,297936.0,152028.0,145908.0,297968.0,152011.0,145957.0
3,10 to 14 years,319655.0,163417.0,156238.0,319654.0,163416.0,156238.0,320124.0,163610.0,156514.0,321557.0,164218.0,157339.0,319783.0,163003.0,156780.0,316872.0,161407.0,155465.0,313817.0,159807.0,154010.0,309432.0,157748.0,151684.0,306442.0,156277.0,150165.0,307962.0,157234.0,150728.0,310286.0,158134.0,152152.0,310498.0,158134.0,152364.0
4,15 to 19 years,343471.0,175151.0,168320.0,343475.0,175155.0,168320.0,340821.0,173960.0,166861.0,329841.0,168630.0,161211.0,323788.0,165476.0,158312.0,321016.0,163390.0,157626.0,318331.0,161846.0,156485.0,319474.0,162373.0,157101.0,320661.0,162860.0,157801.0,318271.0,161489.0,156782.0,315919.0,160095.0,155824.0,313615.0,159086.0,154529.0

In [51]:
Alabama_age= Alabama[['Age','2017 Female','2018 Female','2019 Female']]
Alabama_age.head()

              Age  2017 Female  2018 Female  2019 Female
0           Total    2515803.0    2524361.0    2533668.0
1   Under 5 years     144926.0     145127.0     144642.0
2    5 to 9 years     147760.0     145908.0     145957.0
3  10 to 14 years     150728.0     152152.0     152364.0
4  15 to 19 years     156782.0     155824.0     154529.0

In [52]:
Alabama_age= Alabama_age.iloc[4:10]

In [53]:
Alabama_age

              Age  2017 Female  2018 Female  2019 Female
4  15 to 19 years     156782.0     155824.0     154529.0
5  20 to 24 years     163072.0     161709.0     160699.0
6  25 to 29 years     170715.0     170712.0     169504.0
7  30 to 34 years     154630.0     155448.0     157860.0
8  35 to 39 years     155452.0     156427.0     156924.0
9  40 to 44 years     149348.0     148840.0     149802.0

In [54]:
Alabama_age.dtypes

Age             object
2017 Female    float64
2018 Female    float64
2019 Female    float64
dtype: object

In [55]:
Alabama_precovid_Pop=Alabama_age.sum(axis=1)
Alabama_precovid_Pop

4    467135.0
5    485480.0
6    510931.0
7    467938.0
8    468803.0
9    447990.0
dtype: float64

In [56]:
Alabama_PreCovid_Pop_Avg= round(Alabama_precovid_Pop.mean())
Alabama_PreCovid_Pop_Avg

474713

In [57]:
Alaska = pd.read_excel('../data/Population/Alaska.xlsx',skiprows=4)
Alaska.head()

,Unnamed: 0,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,710231.0,369628.0,340603.0,710249.0,369642.0,340607.0,713910.0,371594.0,342316.0,722128.0,375801.0,346327.0,730443.0,380830.0,349613.0,737068.0,385632.0,351436.0,736283.0,385577.0,350706.0,737498.0,386240.0,351258.0,741456.0,388035.0,353421.0,739700.0,386279.0,353421.0,735139.0,383447.0,351692.0,731545.0,381418.0,350127.0
1,.Under 5 years,53996.0,27896.0,26100.0,53996.0,27896.0,26100.0,54405.0,28028.0,26377.0,55361.0,28521.0,26840.0,55156.0,28422.0,26734.0,55431.0,28552.0,26879.0,55343.0,28402.0,26941.0,55175.0,28290.0,26885.0,54912.0,28026.0,26886.0,54068.0,27605.0,26463.0,52454.0,26727.0,25727.0,51080.0,26153.0,24927.0
2,.5 to 9 years,50887.0,26038.0,24849.0,50887.0,26038.0,24849.0,51069.0,26123.0,24946.0,51358.0,26363.0,24995.0,51909.0,26590.0,25319.0,52104.0,26719.0,25385.0,51808.0,26788.0,25020.0,51789.0,26783.0,25006.0,52581.0,27227.0,25354.0,52337.0,27027.0,25310.0,52033.0,26794.0,25239.0,51596.0,26401.0,25195.0
3,.10 to 14 years,50816.0,26147.0,24669.0,50816.0,26147.0,24669.0,50916.0,26179.0,24737.0,50855.0,26125.0,24730.0,50769.0,26100.0,24669.0,50714.0,26180.0,24534.0,49910.0,25679.0,24231.0,49402.0,25287.0,24115.0,49552.0,25400.0,24152.0,49647.0,25410.0,24237.0,49501.0,25509.0,23992.0,49066.0,25403.0,23663.0
4,.15 to 19 years,52141.0,27179.0,24962.0,52142.0,27180.0,24962.0,51992.0,27140.0,24852.0,50776.0,26590.0,24186.0,49533.0,25977.0,23556.0,48770.0,25607.0,23163.0,47997.0,25196.0,22801.0,47364.0,24959.0,22405.0,47193.0,24801.0,22392.0,46643.0,24533.0,22110.0,45848.0,24039.0,21809.0,45110.0,23594.0,21516.0

In [58]:
Alaska_Female=Alaska[['2017 Female','2018 Female','2019 Female']]

In [59]:
Alaska_Female2= Alaska_Female.iloc[32:33].rename(columns={'Unnamed: 0':'Age'})

In [60]:
Alaska_Female2

    2017 Female  2018 Female  2019 Female
32     146369.0     145145.0     144302.0

In [61]:
Alaska_Female2.dtypes

2017 Female    float64
2018 Female    float64
2019 Female    float64
dtype: object

In [62]:
Alaska_PreCovid_Pop_Avg = Alaska_Female2.mean(axis=1).astype(int)

In [63]:
Alaska_PreCovid_Pop_Avg

32    145272
dtype: int32

In [64]:
Arizona= pd.read_excel('../data/Population/Arizona.xlsx',skiprows=4)
Arizona.head(1)

,Unnamed: 0,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,6392017.0,3175823.0,3216194.0,6392288.0,3176042.0,3216246.0,6407172.0,3183922.0,3223250.0,6472643.0,3217724.0,3254919.0,6554978.0,3258998.0,3295980.0,6632764.0,3296585.0,3336179.0,6730413.0,3346085.0,3384328.0,6829676.0,3395814.0,3433862.0,6941072.0,3450360.0,3490712.0,7044008.0,3500874.0,3543134.0,7158024.0,3557384.0,3600640.0,7278717.0,3617297.0,3661420.0

In [65]:
Arizona_Female=Arizona[['Unnamed: 0','2017 Female','2018 Female','2019 Female']].iloc[4:10]
Arizona_Female

        Unnamed: 0  2017 Female  2018 Female  2019 Female
4  .15 to 19 years     229046.0     231219.0     233494.0
5  .20 to 24 years     233459.0     235895.0     238938.0
6  .25 to 29 years     242622.0     248487.0     252373.0
7  .30 to 34 years     222486.0     225432.0     231907.0
8  .35 to 39 years     219908.0     224781.0     228707.0
9  .40 to 44 years     207334.0     209872.0     213339.0

In [66]:
Arizona_precovid_Pop= round(Arizona_Female.sum(axis=1).mean())
Arizona_precovid_Pop

688216

In [67]:
pre_covid_winter.head()

     Location  Temp_2017  Temp_2018  Temp_2019  Avg_Temp
0     Alabama       52.7       48.4       50.5      50.5
1     Arizona       45.5       47.0       42.0      44.8
2    Arkansas       46.7       41.3       43.7      43.9
3  California       44.3       47.7       43.8      45.3
4    Colorado       28.6       29.5       25.8      28.0

In [68]:
Arkansas= pd.read_excel('../data/Population/Arkansas.xlsx',skiprows=4)
Arkansas.head()

,Unnamed: 0,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,2915918.0,1431637.0,1484281.0,2916031.0,1431697.0,1484334.0,2921964.0,1434724.0,1487240.0,2940667.0,1444262.0,1496405.0,2952164.0,1450121.0,1502043.0,2959400.0,1453371.0,1506029.0,2967392.0,1457266.0,1510126.0,2978048.0,1463068.0,1514980.0,2989918.0,1468953.0,1520965.0,3001345.0,1474639.0,1526706.0,3009733.0,1478109.0,1531624.0,3017804.0,1481616.0,1536188.0
1,.Under 5 years,197689.0,100950.0,96739.0,197693.0,100952.0,96741.0,197390.0,100794.0,96596.0,196277.0,100286.0,95991.0,194436.0,99398.0,95038.0,191652.0,98144.0,93508.0,191111.0,98006.0,93105.0,191125.0,98212.0,92913.0,191402.0,98491.0,92911.0,190929.0,98034.0,92895.0,190281.0,97618.0,92663.0,188464.0,96655.0,91809.0
2,.5 to 9 years,196877.0,100871.0,96006.0,196883.0,100874.0,96009.0,196917.0,100785.0,96132.0,197456.0,100808.0,96648.0,199420.0,102117.0,97303.0,200202.0,102337.0,97865.0,198930.0,101477.0,97453.0,198084.0,101016.0,97068.0,196829.0,100435.0,96394.0,195304.0,99913.0,95391.0,193033.0,98843.0,94190.0,192747.0,98863.0,93884.0
3,.10 to 14 years,197559.0,100896.0,96663.0,197566.0,100900.0,96666.0,198040.0,101207.0,96833.0,199409.0,101957.0,97452.0,198886.0,101716.0,97170.0,198271.0,101452.0,96819.0,197880.0,101437.0,96443.0,197078.0,101011.0,96067.0,197288.0,100862.0,96426.0,199394.0,102018.0,97376.0,200670.0,102546.0,98124.0,200466.0,102418.0,98048.0
4,.15 to 19 years,203805.0,104178.0,99627.0,203807.0,104181.0,99626.0,203269.0,104016.0,99253.0,200016.0,102484.0,97532.0,197713.0,101208.0,96505.0,197053.0,100737.0,96316.0,196905.0,100600.0,96305.0,198080.0,101203.0,96877.0,198723.0,101601.0,97122.0,197931.0,101153.0,96778.0,197607.0,101265.0,96342.0,197251.0,101079.0,96172.0

In [69]:
Arkansas_Female=Arkansas[['Unnamed: 0','2017 Female','2018 Female','2019 Female']]
Arkansas_Female.head()

        Unnamed: 0  2017 Female  2018 Female  2019 Female
0            Total    1526706.0    1531624.0    1536188.0
1   .Under 5 years      92895.0      92663.0      91809.0
2    .5 to 9 years      95391.0      94190.0      93884.0
3  .10 to 14 years      97376.0      98124.0      98048.0
4  .15 to 19 years      96778.0      96342.0      96172.0

In [70]:
Arkansas_Female2 = Arkansas_Female.iloc[4:10]
Arkansas_Female2

        Unnamed: 0  2017 Female  2018 Female  2019 Female
4  .15 to 19 years      96778.0      96342.0      96172.0
5  .20 to 24 years      99228.0      98752.0      98538.0
6  .25 to 29 years     102030.0     102352.0     101740.0
7  .30 to 34 years      95002.0      94960.0      95820.0
8  .35 to 39 years      94837.0      95819.0      96239.0
9  .40 to 44 years      88956.0      89075.0      89810.0

In [71]:
Arkansas_precovid_Pop=Arkansas_Female2.sum(axis=1)
Arkansas_precovid_Pop

4    289292.0
5    296518.0
6    306122.0
7    285782.0
8    286895.0
9    267841.0
dtype: float64

In [72]:
Arkansas_PreCovid_Pop_Avg= round(Arkansas_precovid_Pop.mean())
Arkansas_PreCovid_Pop_Avg

288742

In [73]:
California= pd.read_excel('../data/Population/California.xlsx',skiprows=4)
California.head()

,Unnamed: 0,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,37253956.0,18517830.0,18736126.0,37254519.0,18518141.0,18736378.0,37319502.0,18545938.0,18773564.0,37638369.0,18695322.0,18943047.0,37948800.0,18848732.0,19100068.0,38260787.0,18999298.0,19261489.0,38596972.0,19169077.0,19427895.0,38918045.0,19334449.0,19583596.0,39167117.0,19461322.0,19705795.0,39358497.0,19563172.0,19795325.0,39461588.0,19618452.0,19843136.0,39512223.0,19644854.0,19867369.0
1,.Under 5 years,2531333.0,1294056.0,1237277.0,2531334.0,1294055.0,1237279.0,2530151.0,1293430.0,1236721.0,2533233.0,1294973.0,1238260.0,2514767.0,1285363.0,1229404.0,2500952.0,1277653.0,1223299.0,2505438.0,1280958.0,1224480.0,2508131.0,1283392.0,1224739.0,2486786.0,1272632.0,1214154.0,2466351.0,1262493.0,1203858.0,2426483.0,1242509.0,1183974.0,2383716.0,1220085.0,1163631.0
2,.5 to 9 years,2505839.0,1279563.0,1226276.0,2505841.0,1279563.0,1226278.0,2504746.0,1278744.0,1226002.0,2512748.0,1282672.0,1230076.0,2538033.0,1296162.0,1241871.0,2556133.0,1306311.0,1249822.0,2550998.0,1303591.0,1247407.0,2541392.0,1298552.0,1242840.0,2536020.0,1295858.0,1240162.0,2511576.0,1283269.0,1228307.0,2487561.0,1270774.0,1216787.0,2478850.0,1266874.0,1211976.0
3,.10 to 14 years,2590930.0,1325915.0,1265015.0,2590933.0,1325918.0,1265015.0,2583939.0,1321752.0,1262187.0,2562432.0,1309496.0,1252936.0,2537103.0,1295701.0,1241402.0,2525699.0,1288737.0,1236962.0,2524023.0,1286907.0,1237116.0,2517719.0,1283323.0,1234396.0,2520209.0,1285077.0,1235132.0,2539199.0,1295890.0,1243309.0,2546718.0,1301441.0,1245277.0,2529137.0,1292852.0,1236285.0
4,.15 to 19 years,2823940.0,1455082.0,1368858.0,2823960.0,1455101.0,1368859.0,2808286.0,1446571.0,1361715.0,2745490.0,1412918.0,1332572.0,2697945.0,1385187.0,1312758.0,2656458.0,1360715.0,1295743.0,2617626.0,1338866.0,1278760.0,2598665.0,1328801.0,1269864.0,2579376.0,1318030.0,1261346.0,2555367.0,1305127.0,1250240.0,2542222.0,1297750.0,1244472.0,2533694.0,1292178.0,1241516.0

In [74]:
California_Female=round(California[['Unnamed: 0','2017 Female','2018 Female','2019 Female']].iloc[4:10].sum(axis=1).mean())
California_Female

4033837

In [75]:
Colorado= pd.read_excel('../data/Population/Colorado.xlsx',skiprows=4)
Colorado.head()

,Unnamed: 0,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,5029196.0,2520662.0,2508534.0,5029319.0,2520677.0,2508642.0,5047349.0,2529516.0,2517833.0,5121108.0,2566468.0,2554640.0,5192647.0,2603202.0,2589445.0,5269035.0,2642731.0,2626304.0,5350101.0,2686140.0,2663961.0,5450623.0,2739764.0,2710859.0,5539215.0,2786785.0,2752430.0,5611885.0,2825245.0,2786640.0,5691287.0,2865761.0,2825526.0,5758736.0,2901348.0,2857388.0
1,.Under 5 years,343960.0,176361.0,167599.0,343961.0,176361.0,167600.0,344093.0,176363.0,167730.0,341986.0,175477.0,166509.0,338457.0,173878.0,164579.0,335059.0,171813.0,163246.0,334389.0,171075.0,163314.0,335388.0,171497.0,163891.0,335594.0,171155.0,164439.0,334492.0,170473.0,164019.0,334752.0,170553.0,164199.0,332201.0,169135.0,163066.0
2,.5 to 9 years,348603.0,177782.0,170821.0,348602.0,177782.0,170820.0,348933.0,178047.0,170886.0,351633.0,179636.0,171997.0,354960.0,181625.0,173335.0,356587.0,182528.0,174059.0,355903.0,182473.0,173430.0,356325.0,182757.0,173568.0,354986.0,182176.0,172810.0,351095.0,180012.0,171083.0,348431.0,178414.0,170017.0,346783.0,177399.0,169384.0
3,.10 to 14 years,332654.0,170192.0,162462.0,332652.0,170192.0,162460.0,333917.0,170660.0,163257.0,339674.0,173413.0,166261.0,343566.0,175357.0,168209.0,348979.0,178174.0,170805.0,354589.0,181009.0,173580.0,358426.0,182952.0,175474.0,360759.0,184474.0,176285.0,364212.0,186197.0,178015.0,365403.0,186713.0,178690.0,363539.0,186072.0,177467.0
4,.15 to 19 years,339475.0,175730.0,163745.0,339476.0,175729.0,163747.0,339753.0,175917.0,163836.0,340243.0,176171.0,164072.0,338846.0,175080.0,163766.0,339108.0,175105.0,164003.0,341767.0,176364.0,165403.0,347373.0,179255.0,168118.0,353094.0,181859.0,171235.0,356443.0,183683.0,172760.0,361609.0,186144.0,175465.0,365448.0,188223.0,177225.0

In [76]:
Colorado_Female=round(Colorado[['Unnamed: 0','2017 Female','2018 Female','2019 Female']].iloc[4:10].sum(axis=1).mean())
Colorado_Female

579876

In [77]:
Connecticut= pd.read_excel('../data/Population/Connecticut.xlsx',skiprows=4)
Connecticut.head()

,Unnamed: 0,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,3574097.0,1739614.0,1834483.0,3574147.0,1739639.0,1834508.0,3579114.0,1742318.0,1836796.0,3588283.0,1747545.0,1840738.0,3594547.0,1751238.0,1843309.0,3594841.0,1752177.0,1842664.0,3594524.0,1752902.0,1841622.0,3587122.0,1749678.0,1837444.0,3578141.0,1745231.0,1832910.0,3573297.0,1743058.0,1830239.0,3571520.0,1742123.0,1829397.0,3565287.0,1739417.0,1825870.0
1,.Under 5 years,202106.0,103475.0,98631.0,202114.0,103479.0,98635.0,201246.0,103011.0,98235.0,197752.0,101055.0,96697.0,194260.0,99180.0,95080.0,190351.0,97109.0,93242.0,188416.0,96318.0,92098.0,186624.0,95331.0,91293.0,184639.0,94386.0,90253.0,183825.0,94064.0,89761.0,183048.0,93792.0,89256.0,181710.0,93028.0,88682.0
2,.5 to 9 years,222571.0,113763.0,108808.0,222575.0,113765.0,108810.0,221819.0,113400.0,108419.0,219437.0,112176.0,107261.0,217560.0,111012.0,106548.0,214399.0,109346.0,105053.0,209961.0,107115.0,102846.0,205673.0,105034.0,100639.0,202075.0,103167.0,98908.0,199036.0,101738.0,97298.0,196223.0,100093.0,96130.0,194738.0,99449.0,95289.0
3,.10 to 14 years,240265.0,122924.0,117341.0,240267.0,122925.0,117342.0,239604.0,122590.0,117014.0,237785.0,121776.0,116009.0,234516.0,120117.0,114399.0,231680.0,118637.0,113043.0,228566.0,116931.0,111635.0,224952.0,115051.0,109901.0,221948.0,113271.0,108677.0,219970.0,111941.0,108029.0,218159.0,110925.0,107234.0,214262.0,108848.0,105414.0
4,.15 to 19 years,250834.0,128949.0,121885.0,250831.0,128948.0,121883.0,253575.0,130125.0,123450.0,256925.0,131382.0,125543.0,257122.0,131281.0,125841.0,253825.0,129489.0,124336.0,252082.0,128760.0,123322.0,249575.0,127336.0,122239.0,247310.0,126160.0,121150.0,244184.0,124444.0,119740.0,241659.0,123117.0,118542.0,238872.0,121596.0,117276.0

In [78]:
Connecticut_Female=Connecticut[['Unnamed: 0','2017 Female','2018 Female','2019 Female']].iloc[4:10]
Connecticut_Female

        Unnamed: 0  2017 Female  2018 Female  2019 Female
4  .15 to 19 years     119740.0     118542.0     117276.0
5  .20 to 24 years     119051.0     117862.0     116828.0
6  .25 to 29 years     106219.0     107417.0     108598.0
7  .30 to 34 years     110052.0     110817.0     110584.0
8  .35 to 39 years     109326.0     110669.0     111260.0
9  .40 to 44 years     105794.0     105195.0     106026.0

In [79]:
Connecticut_precovid_Pop= round(Connecticut_Female.sum(axis=1).mean())
Connecticut_precovid_Pop

335209

In [80]:
Delaware= pd.read_excel('../data/Population/Delaware.xlsx',skiprows=4)
Delaware.head()

,Unnamed: 0,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,897934.0,434939.0,462995.0,897937.0,434940.0,462997.0,899593.0,435650.0,463943.0,907381.0,439252.0,468129.0,915179.0,443237.0,471942.0,923576.0,447018.0,476558.0,932487.0,451378.0,481109.0,941252.0,455639.0,485613.0,948921.0,458940.0,489981.0,956823.0,462589.0,494234.0,965479.0,466838.0,498641.0,973764.0,470793.0,502971.0
1,.Under 5 years,55886.0,28415.0,27471.0,55888.0,28416.0,27472.0,55877.0,28416.0,27461.0,55855.0,28343.0,27512.0,55861.0,28516.0,27345.0,55416.0,28338.0,27078.0,55287.0,28168.0,27119.0,55222.0,28171.0,27051.0,55048.0,27876.0,27172.0,54905.0,27634.0,27271.0,54956.0,27682.0,27274.0,54719.0,27536.0,27183.0
2,.5 to 9 years,56486.0,28777.0,27709.0,56486.0,28777.0,27709.0,56426.0,28738.0,27688.0,56329.0,28632.0,27697.0,56701.0,28641.0,28060.0,56694.0,28493.0,28201.0,56604.0,28534.0,28070.0,56539.0,28506.0,28033.0,56562.0,28502.0,28060.0,56461.0,28616.0,27845.0,56266.0,28566.0,27700.0,56312.0,28682.0,27630.0
3,.10 to 14 years,56848.0,28953.0,27895.0,56848.0,28953.0,27895.0,56872.0,28948.0,27924.0,57142.0,29103.0,28039.0,57038.0,29067.0,27971.0,57018.0,29061.0,27957.0,57087.0,29154.0,27933.0,56960.0,28934.0,28026.0,57179.0,28957.0,28222.0,57416.0,28973.0,28443.0,57660.0,29015.0,28645.0,57663.0,29049.0,28614.0
4,.15 to 19 years,64583.0,32652.0,31931.0,64583.0,32652.0,31931.0,64072.0,32388.0,31684.0,62573.0,31628.0,30945.0,61422.0,31078.0,30344.0,60344.0,30501.0,29843.0,59626.0,30084.0,29542.0,59825.0,30213.0,29612.0,59887.0,30226.0,29661.0,60135.0,30353.0,29782.0,60195.0,30383.0,29812.0,60218.0,30426.0,29792.0

In [81]:
Delaware_Female=Delaware[['Unnamed: 0','2017 Female','2018 Female','2019 Female']].iloc[4:10]
Delaware_Female

        Unnamed: 0  2017 Female  2018 Female  2019 Female
4  .15 to 19 years      29782.0      29812.0      29792.0
5  .20 to 24 years      28946.0      28420.0      28178.0
6  .25 to 29 years      33495.0      33091.0      32289.0
7  .30 to 34 years      30298.0      30993.0      32048.0
8  .35 to 39 years      29303.0      29729.0      30058.0
9  .40 to 44 years      26892.0      27121.0      27682.0

In [82]:
Delaware_precovid_Pop= round(Delaware_Female.sum(axis=1).mean())
Delaware_precovid_Pop

89655

In [83]:
Florida= pd.read_excel('../data/Population/Florida.xlsx',skiprows=4)
Florida.head()

,Unnamed: 0,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,18801310.0,9189355.0,9611955.0,18804564.0,9191134.0,9613430.0,18845537.0,9211956.0,9633581.0,19053237.0,9317859.0,9735378.0,19297822.0,9434998.0,9862824.0,19545621.0,9557134.0,9988487.0,19845911.0,9703801.0,10142110.0,20209042.0,9883313.0,10325729.0,20613477.0,10080258.0,10533219.0,20963613.0,10249840.0,10713773.0,21244317.0,10385373.0,10858944.0,21477737.0,10497056.0,10980681.0
1,.Under 5 years,1073506.0,547985.0,525521.0,1073505.0,547988.0,525517.0,1071487.0,547055.0,524432.0,1072460.0,547797.0,524663.0,1072533.0,547572.0,524961.0,1072102.0,547676.0,524426.0,1086855.0,555533.0,531322.0,1107367.0,566837.0,540530.0,1126114.0,576669.0,549445.0,1138111.0,582960.0,555151.0,1143080.0,584588.0,558492.0,1139742.0,582738.0,557004.0
2,.5 to 9 years,1080255.0,551053.0,529202.0,1080249.0,551049.0,529200.0,1079206.0,550645.0,528561.0,1082935.0,552808.0,530127.0,1097183.0,560134.0,537049.0,1114428.0,569081.0,545347.0,1122120.0,573274.0,548846.0,1132016.0,577972.0,554044.0,1145597.0,584699.0,560898.0,1152515.0,588083.0,564432.0,1155556.0,590322.0,565234.0,1166350.0,596090.0,570260.0
3,.10 to 14 years,1130847.0,578689.0,552158.0,1130855.0,578699.0,552156.0,1131057.0,578555.0,552502.0,1135595.0,580092.0,555503.0,1135299.0,579427.0,555872.0,1133166.0,577948.0,555218.0,1136661.0,579655.0,557006.0,1143248.0,583280.0,559968.0,1159205.0,591042.0,568163.0,1180665.0,601747.0,578918.0,1203372.0,613200.0,590172.0,1206047.0,614949.0,591098.0
4,.15 to 19 years,1228382.0,631287.0,597095.0,1228553.0,631417.0,597136.0,1221079.0,628013.0,593066.0,1193519.0,615683.0,577836.0,1175047.0,606346.0,568701.0,1174605.0,605370.0,569235.0,1172591.0,602972.0,569619.0,1183133.0,607163.0,575970.0,1197099.0,613546.0,583553.0,1204764.0,616807.0,587957.0,1202914.0,615687.0,587227.0,1202436.0,614664.0,587772.0

In [84]:
Florida_Female=Florida[['Unnamed: 0','2017 Female','2018 Female','2019 Female']].iloc[4:10]
Florida_Female

        Unnamed: 0  2017 Female  2018 Female  2019 Female
4  .15 to 19 years     587957.0     587227.0     587772.0
5  .20 to 24 years     620122.0     617967.0     615988.0
6  .25 to 29 years     699568.0     701371.0     695672.0
7  .30 to 34 years     654478.0     665480.0     679927.0
8  .35 to 39 years     642621.0     658919.0     670316.0
9  .40 to 44 years     625926.0     631833.0     639599.0

In [85]:
Florida_precovid_Pop= round(Florida_Female.sum(axis=1).mean())
Florida_precovid_Pop

1930457

In [86]:
Georgia= pd.read_excel('../data/Population/Georgia.xlsx',skiprows=4)
Georgia.head()

,Unnamed: 0,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,9687653.0,4729171.0,4958482.0,9688729.0,4730110.0,4958619.0,9711881.0,4741185.0,4970696.0,9802431.0,4786568.0,5015863.0,9901430.0,4834230.0,5067200.0,9972479.0,4864520.0,5107959.0,10067278.0,4907217.0,5160061.0,10178447.0,4958233.0,5220214.0,10301890.0,5014957.0,5286933.0,10410330.0,5065077.0,5345253.0,10511131.0,5111831.0,5399300.0,10617423.0,5160424.0,5456999.0
1,.Under 5 years,686785.0,350673.0,336112.0,686799.0,350677.0,336122.0,684720.0,349572.0,335148.0,679004.0,346407.0,332597.0,671191.0,342276.0,328915.0,661361.0,336863.0,324498.0,658144.0,335358.0,322786.0,658992.0,335763.0,323229.0,659760.0,335870.0,323890.0,658646.0,335452.0,323194.0,658631.0,335797.0,322834.0,656566.0,334896.0,321670.0
2,.5 to 9 years,695161.0,353909.0,341252.0,695181.0,353920.0,341261.0,694383.0,353516.0,340867.0,694546.0,353725.0,340821.0,698649.0,355899.0,342750.0,703025.0,358335.0,344690.0,702038.0,358326.0,343712.0,700820.0,357404.0,343416.0,698557.0,356233.0,342324.0,693393.0,353151.0,340242.0,685762.0,348999.0,336763.0,685587.0,348924.0,336663.0
3,.10 to 14 years,689684.0,352577.0,337107.0,689709.0,352598.0,337111.0,691541.0,353454.0,338087.0,699339.0,357405.0,341934.0,702891.0,358652.0,344239.0,705882.0,359683.0,346199.0,709803.0,361248.0,348555.0,710012.0,360794.0,349218.0,714443.0,363147.0,351296.0,721324.0,366659.0,354665.0,727975.0,370358.0,357617.0,727416.0,370338.0,357078.0
4,.15 to 19 years,709999.0,362934.0,347065.0,710187.0,363113.0,347074.0,709746.0,363047.0,346699.0,701942.0,359686.0,342256.0,698479.0,357770.0,340709.0,694986.0,355287.0,339699.0,696678.0,355596.0,341082.0,705889.0,360398.0,345491.0,716494.0,365479.0,351015.0,722493.0,367883.0,354610.0,726710.0,369722.0,356988.0,732120.0,371833.0,360287.0

In [87]:
Georgia_Female=Georgia[['Unnamed: 0','2017 Female','2018 Female','2019 Female']].iloc[4:10]
Georgia_Female

        Unnamed: 0  2017 Female  2018 Female  2019 Female
4  .15 to 19 years     354610.0     356988.0     360287.0
5  .20 to 24 years     351597.0     351229.0     352957.0
6  .25 to 29 years     377212.0     382760.0     384940.0
7  .30 to 34 years     354825.0     358157.0     366690.0
8  .35 to 39 years     359171.0     363989.0     366142.0
9  .40 to 44 years     346342.0     345838.0     349003.0

In [88]:
Georgia_precovid_Pop= round(Georgia_Female.sum(axis=1).mean())
Georgia_precovid_Pop

1080456

In [89]:
Hawaii= pd.read_excel('../data/Population/Hawaii.xlsx',skiprows=4)
Hawaii.head()

,Unnamed: 0,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,1360301.0,681243.0,679058.0,1360307.0,681247.0,679060.0,1363963.0,683285.0,680678.0,1379329.0,690914.0,688415.0,1394804.0,699369.0,695435.0,1408243.0,706938.0,701305.0,1414538.0,710642.0,703896.0,1422052.0,714699.0,707353.0,1427559.0,717316.0,710243.0,1424393.0,714365.0,710028.0,1420593.0,711291.0,709302.0,1415872.0,708040.0,707832.0
1,.Under 5 years,87407.0,45019.0,42388.0,87407.0,45019.0,42388.0,87774.0,45277.0,42497.0,90086.0,46449.0,43637.0,91251.0,46855.0,44396.0,91929.0,47170.0,44759.0,92177.0,47407.0,44770.0,92326.0,47557.0,44769.0,91246.0,46766.0,44480.0,89567.0,46162.0,43405.0,87412.0,44963.0,42449.0,85219.0,43782.0,41437.0
2,.5 to 9 years,83361.0,42847.0,40514.0,83362.0,42848.0,40514.0,83255.0,42796.0,40459.0,83850.0,43244.0,40606.0,85413.0,44230.0,41183.0,86272.0,44535.0,41737.0,85886.0,44178.0,41708.0,85966.0,44067.0,41899.0,86469.0,44473.0,41996.0,86521.0,44295.0,42226.0,86526.0,44434.0,42092.0,86710.0,44660.0,42050.0
3,.10 to 14 years,81539.0,41699.0,39840.0,81538.0,41699.0,39839.0,81516.0,41685.0,39831.0,81723.0,41759.0,39964.0,81830.0,41867.0,39963.0,82280.0,42306.0,39974.0,82150.0,42256.0,39894.0,82223.0,42220.0,40003.0,81774.0,42060.0,39714.0,82068.0,42345.0,39723.0,81853.0,42024.0,39829.0,80876.0,41389.0,39487.0
4,.15 to 19 years,85994.0,44590.0,41404.0,85993.0,44590.0,41403.0,85806.0,44541.0,41265.0,83417.0,43192.0,40225.0,81444.0,41974.0,39470.0,80162.0,41330.0,38832.0,78648.0,40599.0,38049.0,78257.0,40474.0,37783.0,78052.0,40314.0,37738.0,77400.0,39863.0,37537.0,77168.0,39877.0,37291.0,77287.0,39985.0,37302.0

In [90]:
Hawaii_Female=Hawaii[['Unnamed: 0','2017 Female','2018 Female','2019 Female']].iloc[4:10]
Hawaii_Female

        Unnamed: 0  2017 Female  2018 Female  2019 Female
4  .15 to 19 years      37537.0      37291.0      37302.0
5  .20 to 24 years      41758.0      40752.0      39983.0
6  .25 to 29 years      49591.0      49060.0      48114.0
7  .30 to 34 years      48747.0      48083.0      47757.0
8  .35 to 39 years      46582.0      47532.0      47721.0
9  .40 to 44 years      41339.0      41552.0      41991.0

In [91]:
Hawaii_precovid_Pop= round(Hawaii_Female.sum(axis=1).mean())
Hawaii_precovid_Pop

132115

In [92]:
Idaho= pd.read_excel('../data/Population/Idaho.xlsx',skiprows=4)
Idaho.head(1)

,Unnamed: 0,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,1567582.0,785324.0,782258.0,1567657.0,785352.0,782305.0,1570746.0,786799.0,783947.0,1583910.0,793131.0,790779.0,1595324.0,798801.0,796523.0,1611206.0,806974.0,804232.0,1631112.0,817195.0,813917.0,1651059.0,827105.0,823954.0,1682380.0,842696.0,839684.0,1717715.0,860442.0,857273.0,1750536.0,877331.0,873205.0,1787065.0,895928.0,891137.0

In [93]:
Idaho_Female=Idaho[['Unnamed: 0','2017 Female','2018 Female','2019 Female']].iloc[4:10]
Idaho_Female

        Unnamed: 0  2017 Female  2018 Female  2019 Female
4  .15 to 19 years      59706.0      60354.0      61406.0
5  .20 to 24 years      53959.0      54696.0      55390.0
6  .25 to 29 years      56872.0      57958.0      58782.0
7  .30 to 34 years      54747.0      55440.0      56991.0
8  .35 to 39 years      55631.0      57228.0      58516.0
9  .40 to 44 years      49583.0      51614.0      53736.0

In [94]:
Idaho_precovid_Pop= round(Idaho_Female.sum(axis=1).mean())
Idaho_precovid_Pop

168768

In [95]:
Illinois= pd.read_excel('../data/Population/Illinois.xlsx',skiprows=4)
Illinois.head(1)

,Unnamed: 0,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,12830632.0,6292276.0,6538356.0,12831572.0,6292576.0,6538996.0,12840503.0,6297105.0,6543398.0,12867454.0,6311829.0,6555625.0,12882510.0,6320044.0,6562466.0,12895129.0,6329083.0,6566046.0,12884493.0,6324472.0,6560021.0,12858913.0,6313932.0,6544981.0,12820527.0,6297319.0,6523208.0,12778828.0,6278226.0,6500602.0,12723071.0,6251344.0,6471727.0,12671821.0,6226558.0,6445263.0

In [96]:
Illinois_Female=Illinois[['Unnamed: 0','2017 Female','2018 Female','2019 Female']].iloc[4:10]
Illinois_Female

        Unnamed: 0  2017 Female  2018 Female  2019 Female
4  .15 to 19 years     408030.0     404656.0     402205.0
5  .20 to 24 years     423740.0     415455.0     408950.0
6  .25 to 29 years     445450.0     444509.0     442312.0
7  .30 to 34 years     432644.0     427699.0     425479.0
8  .35 to 39 years     424820.0     426105.0     424190.0
9  .40 to 44 years     394254.0     392540.0     394115.0

In [97]:
Illinois_precovid_Pop= round(Illinois_Female.sum(axis=1).mean())
Illinois_precovid_Pop

1256192

In [98]:
Indiana= pd.read_excel('../data/Population/Indiana.xlsx',skiprows=4)
Indiana.head(1)

,Unnamed: 0,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,6483802.0,3189737.0,3294065.0,6484051.0,3189829.0,3294222.0,6490432.0,3193102.0,3297330.0,6516528.0,3206597.0,3309931.0,6537703.0,3218907.0,3318796.0,6568713.0,3235209.0,3333504.0,6593644.0,3248258.0,3345386.0,6608422.0,3256765.0,3351657.0,6634304.0,3270126.0,3364178.0,6658078.0,3281780.0,3376298.0,6695497.0,3301286.0,3394211.0,6732219.0,3320360.0,3411859.0

In [99]:
Indiana_Female=Indiana[['Unnamed: 0','2017 Female','2018 Female','2019 Female']].iloc[4:10]
Indiana_Female

        Unnamed: 0  2017 Female  2018 Female  2019 Female
4  .15 to 19 years     222910.0     223059.0     222966.0
5  .20 to 24 years     231367.0     231054.0     230809.0
6  .25 to 29 years     223392.0     226847.0     228815.0
7  .30 to 34 years     208353.0     209186.0     212436.0
8  .35 to 39 years     210765.0     213474.0     214045.0
9  .40 to 44 years     197862.0     198562.0     201383.0

In [100]:
Indiana_precovid_Pop= round(Indiana_Female.sum(axis=1).mean())
Indiana_precovid_Pop

651214

In [101]:
Iowa= pd.read_excel('../data/Population/Iowa.xlsx',skiprows=4)
Iowa.head(1)

,Unnamed: 0,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,3046355.0,1508319.0,1538036.0,3046871.0,1508830.0,1538041.0,3050745.0,1510930.0,1539815.0,3066336.0,1520005.0,1546331.0,3076190.0,1525671.0,1550519.0,3092997.0,1534885.0,1558112.0,3109350.0,1544065.0,1565285.0,3120960.0,1551227.0,1569733.0,3131371.0,1557159.0,1574212.0,3141550.0,1562936.0,1578614.0,3148618.0,1566963.0,1581655.0,3155070.0,1571075.0,1583995.0

In [102]:
Iowa_Female=Iowa[['Unnamed: 0','2017 Female','2018 Female','2019 Female']].iloc[4:10]
Iowa_Female

        Unnamed: 0  2017 Female  2018 Female  2019 Female
4  .15 to 19 years     104327.0     103595.0     103383.0
5  .20 to 24 years     110213.0     109520.0     108676.0
6  .25 to 29 years      97423.0      98790.0      99272.0
7  .30 to 34 years      95673.0      94409.0      93934.0
8  .35 to 39 years      97682.0      98967.0      99254.0
9  .40 to 44 years      85721.0      87353.0      89764.0

In [103]:
Iowa_precovid_Pop= round(Iowa_Female.sum(axis=1).mean())
Iowa_precovid_Pop

296326

In [104]:
Kansas= pd.read_excel('../data/Population/Kansas.xlsx',skiprows=4)
Kansas.head(1)

,Unnamed: 0,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,2853118.0,1415408.0,1437710.0,2853123.0,1415414.0,1437709.0,2858190.0,1418108.0,1440082.0,2869225.0,1423986.0,1445239.0,2885257.0,1433837.0,1451420.0,2893212.0,1439334.0,1453878.0,2900475.0,1444366.0,1456109.0,2909011.0,1449371.0,1459640.0,2910844.0,1450247.0,1460597.0,2908718.0,1449207.0,1459511.0,2911359.0,1450771.0,1460588.0,2913314.0,1451697.0,1461617.0

In [105]:
Kansas_Female=Kansas[['Unnamed: 0','2017 Female','2018 Female','2019 Female']].iloc[4:10]
Kansas_Female

        Unnamed: 0  2017 Female  2018 Female  2019 Female
4  .15 to 19 years      96466.0      96813.0      96680.0
5  .20 to 24 years     102277.0     101893.0     101498.0
6  .25 to 29 years      92998.0      93547.0      93853.0
7  .30 to 34 years      93972.0      92583.0      91408.0
8  .35 to 39 years      91989.0      93947.0      94736.0
9  .40 to 44 years      81222.0      82100.0      83716.0

In [106]:
Kansas_precovid_Pop= round(Kansas_Female.sum(axis=1).mean())
Kansas_precovid_Pop

280283

In [107]:
Kentucky= pd.read_excel('../data/Population/Kentucky.xlsx',skiprows=4)
Kentucky.head(1)

,Unnamed: 0,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,4339367.0,2134952.0,2204415.0,4339333.0,2134932.0,2204401.0,4348181.0,2139425.0,2208756.0,4369821.0,2149754.0,2220067.0,4386346.0,2159610.0,2226736.0,4404659.0,2169884.0,2234775.0,4414349.0,2174232.0,2240117.0,4425976.0,2180640.0,2245336.0,4438182.0,2186168.0,2252014.0,4452268.0,2193441.0,2258827.0,4461153.0,2197550.0,2263603.0,4467673.0,2201029.0,2266644.0

In [108]:
Kentucky_Female=Kentucky[['Unnamed: 0','2017 Female','2018 Female','2019 Female']].iloc[4:10]
Kentucky_Female

        Unnamed: 0  2017 Female  2018 Female  2019 Female
4  .15 to 19 years     139884.0     139257.0     139306.0
5  .20 to 24 years     145533.0     144692.0     143968.0
6  .25 to 29 years     150769.0     151956.0     150646.0
7  .30 to 34 years     136521.0     135588.0     137484.0
8  .35 to 39 years     141448.0     141888.0     141124.0
9  .40 to 44 years     134368.0     134522.0     135495.0

In [109]:
Kentucky_precovid_Pop= round(Kentucky_Female.sum(axis=1).mean())
Kentucky_precovid_Pop

424075

In [110]:
Louisiana= pd.read_excel('../data/Population/Louisiana.xlsx',skiprows=4)
Louisiana.head(1)

,Unnamed: 0,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,4533372.0,2219292.0,2314080.0,4533487.0,2219358.0,2314129.0,4544532.0,2224663.0,2319869.0,4575625.0,2239408.0,2336217.0,4600972.0,2251300.0,2349672.0,4624527.0,2263090.0,2361437.0,4644013.0,2272715.0,2371298.0,4664628.0,2282743.0,2381885.0,4678135.0,2287883.0,2390252.0,4670560.0,2281654.0,2388906.0,4659690.0,2274242.0,2385448.0,4648794.0,2267050.0,2381744.0

In [111]:
Louisiana_Female=Louisiana[['Unnamed: 0','2017 Female','2018 Female','2019 Female']].iloc[4:10]
Louisiana_Female

        Unnamed: 0  2017 Female  2018 Female  2019 Female
4  .15 to 19 years     146347.0     145160.0     144005.0
5  .20 to 24 years     155480.0     152064.0     149485.0
6  .25 to 29 years     173990.0     171581.0     166954.0
7  .30 to 34 years     163945.0     162202.0     162369.0
8  .35 to 39 years     155918.0     158716.0     160147.0
9  .40 to 44 years     135623.0     136839.0     139489.0

In [112]:
Louisiana_precovid_Pop= round(Louisiana_Female.sum(axis=1).mean())
Louisiana_precovid_Pop

463386

In [113]:
Maine= pd.read_excel('../data/Population/Maine.xlsx',skiprows=4)
Maine.head(1)

,Unnamed: 0,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,1328361.0,650056.0,678305.0,1328358.0,650055.0,678303.0,1327629.0,649691.0,677938.0,1328284.0,650371.0,677913.0,1327729.0,650094.0,677635.0,1328009.0,650708.0,677301.0,1330513.0,651644.0,678869.0,1328262.0,650386.0,677876.0,1331317.0,651885.0,679432.0,1334612.0,653658.0,680954.0,1339057.0,655683.0,683374.0,1344212.0,658112.0,686100.0

In [114]:
Maine_Female=Maine[['Unnamed: 0','2017 Female','2018 Female','2019 Female']].iloc[4:10]
Maine_Female

        Unnamed: 0  2017 Female  2018 Female  2019 Female
4  .15 to 19 years      38084.0      37804.0      37436.0
5  .20 to 24 years      37190.0      36872.0      36457.0
6  .25 to 29 years      39499.0      39876.0      39875.0
7  .30 to 34 years      39316.0      39748.0      40871.0
8  .35 to 39 years      39000.0      39702.0      40004.0
9  .40 to 44 years      37780.0      37622.0      38085.0

In [115]:
Maine_precovid_Pop= round(Maine_Female.sum(axis=1).mean())
Maine_precovid_Pop

115870

In [116]:
Maryland= pd.read_excel('../data/Population/Maryland.xlsx',skiprows=4)
Maryland.head(1)

,Unnamed: 0,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,5773552.0,2791762.0,2981790.0,5773794.0,2791894.0,2981900.0,5788645.0,2799911.0,2988734.0,5839419.0,2826356.0,3013063.0,5886992.0,2851608.0,3035384.0,5923188.0,2869907.0,3053281.0,5957283.0,2886242.0,3071041.0,5985562.0,2900516.0,3085046.0,6003323.0,2909885.0,3093438.0,6023868.0,2919625.0,3104243.0,6035802.0,2924599.0,3111203.0,6045680.0,2928865.0,3116815.0

In [117]:
Maryland_Female=Maryland[['Unnamed: 0','2017 Female','2018 Female','2019 Female']].iloc[4:10]
Maryland_Female

        Unnamed: 0  2017 Female  2018 Female  2019 Female
4  .15 to 19 years     187375.0     187022.0     186613.0
5  .20 to 24 years     188124.0     184470.0     182472.0
6  .25 to 29 years     207876.0     206716.0     204624.0
7  .30 to 34 years     209816.0     210535.0     211014.0
8  .35 to 39 years     204542.0     208253.0     210226.0
9  .40 to 44 years     187830.0     188022.0     190483.0

In [118]:
Maryland_precovid_Pop= round(Maryland_Female.sum(axis=1).mean())
Maryland_precovid_Pop

592669

In [119]:
Massachusetts= pd.read_excel('../data/Population/Massachusetts.xlsx',skiprows=4)
Massachusetts.head(1)

,Unnamed: 0,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,6547629.0,3166628.0,3381001.0,6547785.0,3166698.0,3381087.0,6566307.0,3176134.0,3390173.0,6613583.0,3201096.0,3412487.0,6663005.0,3228244.0,3434761.0,6713315.0,3253340.0,3459975.0,6762596.0,3278853.0,3483743.0,6794228.0,3294803.0,3499425.0,6823608.0,3310513.0,3513095.0,6859789.0,3328995.0,3530794.0,6882635.0,3339710.0,3542925.0,6892503.0,3345568.0,3546935.0

In [120]:
Massachusetts_Female=Massachusetts[['Unnamed: 0','2017 Female','2018 Female','2019 Female']].iloc[4:10]
Massachusetts_Female

        Unnamed: 0  2017 Female  2018 Female  2019 Female
4  .15 to 19 years     227198.0     226016.0     224448.0
5  .20 to 24 years     247581.0     246148.0     244058.0
6  .25 to 29 years     248203.0     249214.0     248655.0
7  .30 to 34 years     238739.0     242805.0     245738.0
8  .35 to 39 years     218246.0     221969.0     224617.0
9  .40 to 44 years     204644.0     204530.0     206091.0

In [121]:
Massachusetts_precovid_Pop= round(Massachusetts_Female.sum(axis=1).mean())
Massachusetts_precovid_Pop

694817

In [122]:
Michigan= pd.read_excel('../data/Population/Michigan.xlsx',skiprows=4)
Michigan.head(1)

,Unnamed: 0,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,9883640.0,4848114.0,5035526.0,9884116.0,4848476.0,5035640.0,9877510.0,4845176.0,5032334.0,9882412.0,4848240.0,5034172.0,9897145.0,4858860.0,5038285.0,9913065.0,4868915.0,5044150.0,9929848.0,4880033.0,5049815.0,9931715.0,4884403.0,5047312.0,9950571.0,4896613.0,5053958.0,9973114.0,4909981.0,5063133.0,9984072.0,4916210.0,5067862.0,9986857.0,4918528.0,5068329.0

In [123]:
Michigan_Female=Michigan[['Unnamed: 0','2017 Female','2018 Female','2019 Female']].iloc[4:10]
Michigan_Female

        Unnamed: 0  2017 Female  2018 Female  2019 Female
4  .15 to 19 years     323834.0     319391.0     315633.0
5  .20 to 24 years     343961.0     339026.0     333914.0
6  .25 to 29 years     332189.0     338025.0     339874.0
7  .30 to 34 years     295289.0     297392.0     302872.0
8  .35 to 39 years     298344.0     300533.0     300007.0
9  .40 to 44 years     285092.0     284242.0     286172.0

In [124]:
Michigan_precovid_Pop= round(Michigan_Female.sum(axis=1).mean())
Michigan_precovid_Pop

939298

In [125]:
Minnesota= pd.read_excel('../data/Population/Minnesota.xlsx',skiprows=4)
Minnesota.head(1)

,Unnamed: 0,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,5303925.0,2632132.0,2671793.0,5303927.0,2632133.0,2671794.0,5310828.0,2635585.0,2675243.0,5346143.0,2654246.0,2691897.0,5376643.0,2670875.0,2705768.0,5413479.0,2689866.0,2723613.0,5451079.0,2709768.0,2741311.0,5482032.0,2727110.0,2754922.0,5522744.0,2748861.0,2773883.0,5566230.0,2771544.0,2794686.0,5606249.0,2792427.0,2813822.0,5639632.0,2809811.0,2829821.0

In [126]:
Minnesota_Female=Minnesota[['Unnamed: 0','2017 Female','2018 Female','2019 Female']].iloc[4:10]
Minnesota_Female

        Unnamed: 0  2017 Female  2018 Female  2019 Female
4  .15 to 19 years     174710.0     175131.0     176831.0
5  .20 to 24 years     178263.0     177333.0     176376.0
6  .25 to 29 years     179932.0     182503.0     183591.0
7  .30 to 34 years     189357.0     188452.0     187715.0
8  .35 to 39 years     183908.0     188528.0     191764.0
9  .40 to 44 years     157197.0     160683.0     165379.0

In [127]:
Minnesota_precovid_Pop= round(Minnesota_Female.sum(axis=1).mean())
Minnesota_precovid_Pop

536276

In [128]:
Mississippi= pd.read_excel('../data/Population/Mississippi.xlsx',skiprows=4)
Mississippi.head(1)

,Unnamed: 0,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,2967297.0,1441240.0,1526057.0,2968130.0,1441948.0,1526182.0,2970548.0,1443209.0,1527339.0,2978731.0,1447343.0,1531388.0,2983816.0,1449731.0,1534085.0,2988711.0,1452454.0,1536257.0,2990468.0,1452322.0,1538146.0,2988471.0,1449816.0,1538655.0,2987938.0,1449250.0,1538688.0,2988510.0,1449798.0,1538712.0,2981020.0,1445523.0,1535497.0,2976149.0,1442292.0,1533857.0

In [129]:
Mississippi_Female=Mississippi[['Unnamed: 0','2017 Female','2018 Female','2019 Female']].iloc[4:10]
Mississippi_Female

        Unnamed: 0  2017 Female  2018 Female  2019 Female
4  .15 to 19 years     101514.0      99323.0      98568.0
5  .20 to 24 years     103676.0     100674.0      99310.0
6  .25 to 29 years     104030.0     104529.0     102962.0
7  .30 to 34 years      95399.0      94492.0      95205.0
8  .35 to 39 years      96956.0      97171.0      96756.0
9  .40 to 44 years      90847.0      90627.0      91498.0

In [130]:
Mississippi_precovid_Pop= round(Mississippi_Female.sum(axis=1).mean())
Mississippi_precovid_Pop

293923

In [131]:
Missouri= pd.read_excel('../data/Population/Missouri.xlsx',skiprows=4)
Missouri.head(1)

,Unnamed: 0,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,5988927.0,2933477.0,3055450.0,5988950.0,2933484.0,3055466.0,5995974.0,2937171.0,3058803.0,6010275.0,2944973.0,3065302.0,6024367.0,2952701.0,3071666.0,6040715.0,2962588.0,3078127.0,6056202.0,2970927.0,3085275.0,6071732.0,2979521.0,3092211.0,6087135.0,2987740.0,3099395.0,6106670.0,2997559.0,3109111.0,6121623.0,3004921.0,3116702.0,6137428.0,3012662.0,3124766.0

In [132]:
Missouri_Female=Missouri[['Unnamed: 0','2017 Female','2018 Female','2019 Female']].iloc[4:10]
Missouri_Female

        Unnamed: 0  2017 Female  2018 Female  2019 Female
4  .15 to 19 years     191258.0     190469.0     189903.0
5  .20 to 24 years     201988.0     199611.0     198418.0
6  .25 to 29 years     209508.0     210616.0     209922.0
7  .30 to 34 years     199144.0     198391.0     200070.0
8  .35 to 39 years     193955.0     197554.0     199478.0
9  .40 to 44 years     175059.0     176303.0     179244.0

In [133]:
Missouri_precovid_Pop= round(Missouri_Female.sum(axis=1).mean())
Missouri_precovid_Pop

586815

In [134]:
Montana= pd.read_excel('../data/Population/Montana.xlsx',skiprows=4)
Montana.head(1)

,Unnamed: 0,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,989415.0,496667.0,492748.0,989407.0,496662.0,492745.0,990697.0,497234.0,493463.0,997316.0,500389.0,496927.0,1003783.0,503999.0,499784.0,1013569.0,509354.0,504215.0,1021869.0,513890.0,507979.0,1030475.0,518666.0,511809.0,1040859.0,523985.0,516874.0,1052482.0,529757.0,522725.0,1060665.0,533852.0,526813.0,1068778.0,538066.0,530712.0

In [135]:
Montana_Female=Montana[['Unnamed: 0','2017 Female','2018 Female','2019 Female']].iloc[4:10]
Montana_Female

        Unnamed: 0  2017 Female  2018 Female  2019 Female
4  .15 to 19 years      30542.0      30622.0      30795.0
5  .20 to 24 years      34682.0      34208.0      33961.0
6  .25 to 29 years      33634.0      34362.0      34443.0
7  .30 to 34 years      32284.0      32391.0      32686.0
8  .35 to 39 years      31918.0      32666.0      33384.0
9  .40 to 44 years      28141.0      29006.0      29922.0

In [136]:
Montana_precovid_Pop= round(Montana_Female.sum(axis=1).mean())
Montana_precovid_Pop

96608

In [137]:
Nebraska= pd.read_excel('../data/Population/Nebraska.xlsx',skiprows=4)
Nebraska.head(1)

,Unnamed: 0,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,1826341.0,906296.0,920045.0,1826305.0,906279.0,920026.0,1829542.0,908109.0,921433.0,1840672.0,914014.0,926658.0,1853303.0,920970.0,932333.0,1865279.0,928031.0,937248.0,1879321.0,935882.0,943439.0,1891277.0,942660.0,948617.0,1905616.0,950558.0,955058.0,1915947.0,956365.0,959582.0,1925614.0,961374.0,964240.0,1934408.0,966449.0,967959.0

In [138]:
Nebraska_Female=Nebraska[['Unnamed: 0','2017 Female','2018 Female','2019 Female']].iloc[4:10]
Nebraska_Female

        Unnamed: 0  2017 Female  2018 Female  2019 Female
4  .15 to 19 years      63733.0      64388.0      64915.0
5  .20 to 24 years      66914.0      66470.0      65923.0
6  .25 to 29 years      60942.0      61736.0      62704.0
7  .30 to 34 years      62775.0      61863.0      60988.0
8  .35 to 39 years      61342.0      62845.0      63636.0
9  .40 to 44 years      53541.0      54547.0      55625.0

In [139]:
Nebraska_precovid_Pop= round(Nebraska_Female.sum(axis=1).mean())
Nebraska_precovid_Pop

185814

In [140]:
Nevada= pd.read_excel('../data/Population/Nevada.xlsx',skiprows=4)
Nevada.head(1)

,Unnamed: 0,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,2700551.0,1363616.0,1336935.0,2700677.0,1363714.0,1336963.0,2702405.0,1364110.0,1338295.0,2712730.0,1367741.0,1344989.0,2743996.0,1382708.0,1361288.0,2775970.0,1397405.0,1378565.0,2817628.0,1416980.0,1400648.0,2866939.0,1440269.0,1426670.0,2917563.0,1464809.0,1452754.0,2969905.0,1490259.0,1479646.0,3027341.0,1518521.0,1508820.0,3080156.0,1544827.0,1535329.0

In [141]:
Nevada_Female=Nevada[['Unnamed: 0','2017 Female','2018 Female','2019 Female']].iloc[4:10]
Nevada_Female

        Unnamed: 0  2017 Female  2018 Female  2019 Female
4  .15 to 19 years      86466.0      87664.0      88483.0
5  .20 to 24 years      88194.0      88598.0      88970.0
6  .25 to 29 years     109641.0     111585.0     112322.0
7  .30 to 34 years     103490.0     105632.0     108890.0
8  .35 to 39 years     100503.0     103801.0     106216.0
9  .40 to 44 years      93550.0      94895.0      96635.0

In [142]:
Nevada_precovid_Pop= round(Nevada_Female.sum(axis=1).mean())
Nevada_precovid_Pop

295922

In [143]:
New_Hampshire= pd.read_excel('../data/Population/New Hampshire.xlsx',skiprows=4)
New_Hampshire.head(1)

,Unnamed: 0,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,1316470.0,649394.0,667076.0,1316462.0,649393.0,667069.0,1316762.0,649537.0,667225.0,1320202.0,651380.0,668822.0,1324232.0,653544.0,670688.0,1326622.0,655132.0,671490.0,1333341.0,659234.0,674107.0,1336350.0,661455.0,674895.0,1342307.0,664650.0,677657.0,1348787.0,667781.0,681006.0,1353465.0,670773.0,682692.0,1359711.0,673793.0,685918.0

In [144]:
New_Hampshire_Female=New_Hampshire[['Unnamed: 0','2017 Female','2018 Female','2019 Female']].iloc[4:10]
New_Hampshire_Female

        Unnamed: 0  2017 Female  2018 Female  2019 Female
4  .15 to 19 years      42079.0      41575.0      41445.0
5  .20 to 24 years      44461.0      43455.0      42812.0
6  .25 to 29 years      40340.0      40926.0      41787.0
7  .30 to 34 years      40038.0      40720.0      41545.0
8  .35 to 39 years      38816.0      39610.0      40330.0
9  .40 to 44 years      37976.0      37729.0      37809.0

In [145]:
New_Hampshire_precovid_Pop= round(New_Hampshire_Female.sum(axis=1).mean())
New_Hampshire_precovid_Pop

122242

In [146]:
New_Jersey= pd.read_excel('../data/Population/New Jersey.xlsx',skiprows=4)
New_Jersey.head(1)

,Unnamed: 0,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,8791894.0,4279600.0,4512294.0,8791978.0,4279652.0,4512326.0,8799446.0,4283799.0,4515647.0,8828117.0,4300684.0,4527433.0,8844942.0,4310704.0,4534238.0,8856972.0,4318940.0,4538032.0,8864525.0,4323988.0,4540537.0,8867949.0,4326382.0,4541567.0,8870827.0,4329900.0,4540927.0,8885525.0,4338574.0,4546951.0,8886025.0,4340687.0,4545338.0,8882190.0,4340587.0,4541603.0

In [147]:
New_Jersey_Female=New_Jersey[['Unnamed: 0','2017 Female','2018 Female','2019 Female']].iloc[4:10]
New_Jersey_Female

        Unnamed: 0  2017 Female  2018 Female  2019 Female
4  .15 to 19 years     272476.0     270713.0     269310.0
5  .20 to 24 years     273844.0     269618.0     266233.0
6  .25 to 29 years     278758.0     282071.0     283706.0
7  .30 to 34 years     282267.0     281336.0     282221.0
8  .35 to 39 years     289976.0     291483.0     290920.0
9  .40 to 44 years     281357.0     280349.0     281701.0

In [148]:
New_Jersey_precovid_Pop= round(New_Jersey_Female.sum(axis=1).mean())
New_Jersey_precovid_Pop

838056

In [149]:
New_Mexico= pd.read_excel('../data/Population/New Mexico.xlsx',skiprows=4)
New_Mexico.head(1)

,Unnamed: 0,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,2059179.0,1017421.0,1041758.0,2059199.0,1017428.0,1041771.0,2064552.0,1020289.0,1044263.0,2080450.0,1028183.0,1052267.0,2087309.0,1032727.0,1054582.0,2092273.0,1035782.0,1056491.0,2089568.0,1034795.0,1054773.0,2089291.0,1034391.0,1054900.0,2091630.0,1035615.0,1056015.0,2091784.0,1035394.0,1056390.0,2092741.0,1035540.0,1057201.0,2096829.0,1037432.0,1059397.0

In [150]:
New_Mexico_Female=New_Mexico[['Unnamed: 0','2017 Female','2018 Female','2019 Female']].iloc[4:10]
New_Mexico_Female

        Unnamed: 0  2017 Female  2018 Female  2019 Female
4  .15 to 19 years      68038.0      68065.0      67901.0
5  .20 to 24 years      68966.0      67642.0      67132.0
6  .25 to 29 years      69582.0      69891.0      69896.0
7  .30 to 34 years      67606.0      67181.0      67175.0
8  .35 to 39 years      64522.0      65783.0      66736.0
9  .40 to 44 years      58417.0      58728.0      59632.0

In [151]:
New_Mexico_precovid_Pop= round(New_Mexico_Female.sum(axis=1).mean())
New_Mexico_precovid_Pop

198816

In [152]:
New_York= pd.read_excel('../data/Population/New York.xlsx',skiprows=4)
New_York.head(1)

,Unnamed: 0,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,19378102.0,9377147.0,10000955.0,19378144.0,9377167.0,10000977.0,19399878.0,9389210.0,10010668.0,19499241.0,9442775.0,10056466.0,19572932.0,9485138.0,10087794.0,19624447.0,9514647.0,10109800.0,19651049.0,9529710.0,10121339.0,19654666.0,9534954.0,10119712.0,19633428.0,9530062.0,10103366.0,19589572.0,9511544.0,10078028.0,19530351.0,9484218.0,10046133.0,19453561.0,9447846.0,10005715.0

In [153]:
New_York_Female=New_York[['Unnamed: 0','2017 Female','2018 Female','2019 Female']].iloc[4:10]
New_York_Female

        Unnamed: 0  2017 Female  2018 Female  2019 Female
4  .15 to 19 years     590418.0     583565.0     577660.0
5  .20 to 24 years     661674.0     648360.0     635630.0
6  .25 to 29 years     744750.0     739208.0     731653.0
7  .30 to 34 years     692886.0     695617.0     699055.0
8  .35 to 39 years     638450.0     641914.0     641014.0
9  .40 to 44 years     591913.0     588854.0     589775.0

In [154]:
New_York_precovid_Pop= round(New_York_Female.sum(axis=1).mean())
New_York_precovid_Pop

1948733

In [155]:
North_Carolina= pd.read_excel('../data/Population/North Carolina.xlsx',skiprows=4)
North_Carolina.head(1)

,Unnamed: 0,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,9535483.0,4645492.0,4889991.0,9535751.0,4645619.0,4890132.0,9574323.0,4670070.0,4904253.0,9657592.0,4706319.0,4951273.0,9749476.0,4749609.0,4999867.0,9843336.0,4794336.0,5049000.0,9932887.0,4835634.0,5097253.0,10031646.0,4884624.0,5147022.0,10154788.0,4943712.0,5211076.0,10268233.0,4997202.0,5271031.0,10381615.0,5050327.0,5331288.0,10488084.0,5100264.0,5387820.0

In [156]:
North_Carolina_Female=North_Carolina[['Unnamed: 0','2017 Female','2018 Female','2019 Female']].iloc[4:10]
North_Carolina_Female

        Unnamed: 0  2017 Female  2018 Female  2019 Female
4  .15 to 19 years     334311.0     337351.0     338155.0
5  .20 to 24 years     336012.0     337478.0     338141.0
6  .25 to 29 years     357301.0     361692.0     363173.0
7  .30 to 34 years     332151.0     337257.0     347155.0
8  .35 to 39 years     333590.0     337140.0     339183.0
9  .40 to 44 years     326372.0     327038.0     329949.0

In [157]:
North_Carolina_precovid_Pop= round(North_Carolina_Female.sum(axis=1).mean())
North_Carolina_precovid_Pop

1018908

In [158]:
North_Dakota= pd.read_excel('../data/Population/North_Dakota.xlsx',skiprows=4)
North_Dakota.head(1)

,Age,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,672591.0,339864.0,332727.0,672576.0,339858.0,332718.0,674715.0,341076.0,333639.0,685225.0,347164.0,338061.0,701176.0,356426.0,344750.0,722036.0,368582.0,353454.0,737401.0,377734.0,359667.0,754066.0,387201.0,366865.0,754434.0,387011.0,367423.0,754942.0,386690.0,368252.0,758080.0,388034.0,370046.0,762062.0,390032.0,372030.0

In [159]:
North_Dakota_Female=North_Dakota[['Age','2017 Female','2018 Female','2019 Female']].iloc[4:10]
North_Dakota_Female

              Age  2017 Female  2018 Female  2019 Female
4  15 to 19 years      22629.0      22666.0      22784.0
5  20 to 24 years      30389.0      29873.0      29403.0
6  25 to 29 years      27512.0      27861.0      27729.0
7  30 to 34 years      24651.0      24518.0      24814.0
8  35 to 39 years      22621.0      23217.0      23770.0
9  40 to 44 years      18687.0      19104.0      19653.0

In [160]:
North_Dakota_precovid_Pop= round(North_Dakota_Female.sum(axis=1).mean())
North_Dakota_precovid_Pop

73647

In [161]:
Ohio= pd.read_excel('../data/Population/Ohio.xlsx',skiprows=4)
Ohio.head(1)

,Unnamed: 0,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,11536504.0,5632156.0,5904348.0,11536751.0,5632266.0,5904485.0,11539336.0,5634098.0,5905238.0,11544663.0,5639183.0,5905480.0,11548923.0,5645805.0,5903118.0,11576684.0,5663597.0,5913087.0,11602700.0,5678894.0,5923806.0,11617527.0,5688786.0,5928741.0,11634370.0,5699638.0,5934732.0,11659650.0,5713520.0,5946130.0,11676341.0,5722437.0,5953904.0,11689100.0,5730562.0,5958538.0

In [162]:
Ohio_Female=Ohio[['Unnamed: 0','2017 Female','2018 Female','2019 Female']].iloc[4:10]
Ohio_Female

        Unnamed: 0  2017 Female  2018 Female  2019 Female
4  .15 to 19 years     374562.0     371335.0     369297.0
5  .20 to 24 years     376759.0     372555.0     369692.0
6  .25 to 29 years     394901.0     397777.0     395329.0
7  .30 to 34 years     364107.0     366997.0     374176.0
8  .35 to 39 years     359397.0     363733.0     364521.0
9  .40 to 44 years     335509.0     335526.0     339132.0

In [163]:
Ohio_precovid_Pop= round(Ohio_Female.sum(axis=1).mean())
Ohio_precovid_Pop

1104218

In [164]:
Oklahoma= pd.read_excel('../data/Population/Oklahoma.xlsx',skiprows=4)
Oklahoma.head(1)

,Unnamed: 0,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,3751351.0,1856977.0,1894374.0,3751582.0,1857072.0,1894510.0,3759944.0,1860310.0,1899634.0,3788379.0,1874388.0,1913991.0,3818814.0,1890981.0,1927833.0,3853214.0,1908914.0,1944300.0,3878187.0,1921623.0,1956564.0,3909500.0,1937403.0,1972097.0,3926331.0,1945562.0,1980769.0,3931316.0,1948011.0,1983305.0,3940235.0,1952266.0,1987969.0,3956971.0,1960658.0,1996313.0

In [165]:
Oklahoma_Female=Oklahoma[['Unnamed: 0','2017 Female','2018 Female','2019 Female']].iloc[4:10]
Oklahoma_Female

        Unnamed: 0  2017 Female  2018 Female  2019 Female
4  .15 to 19 years     127918.0     128186.0     128687.0
5  .20 to 24 years     131675.0     130919.0     131368.0
6  .25 to 29 years     138360.0     137760.0     136769.0
7  .30 to 34 years     130907.0     129599.0     130306.0
8  .35 to 39 years     126660.0     130002.0     131579.0
9  .40 to 44 years     113302.0     113928.0     116106.0

In [166]:
Oklahoma_precovid_Pop= round(Oklahoma_Female.sum(axis=1).mean())
Oklahoma_precovid_Pop

385672

In [167]:
Oregon= pd.read_excel('../data/Population/Oregon.xlsx',skiprows=4)
Oregon.head(1)

,Unnamed: 0,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,3831074.0,1896002.0,1935072.0,3831079.0,1896006.0,1935073.0,3837491.0,1899066.0,1938425.0,3872036.0,1915672.0,1956364.0,3899001.0,1929585.0,1969416.0,3922468.0,1941291.0,1981177.0,3963244.0,1961991.0,2001253.0,4015792.0,1988948.0,2026844.0,4089976.0,2026626.0,2063350.0,4143625.0,2053893.0,2089732.0,4181886.0,2073087.0,2108799.0,4217737.0,2090727.0,2127010.0

In [168]:
Oregon_Female=Oregon[['Unnamed: 0','2017 Female','2018 Female','2019 Female']].iloc[4:10]
Oregon_Female

        Unnamed: 0  2017 Female  2018 Female  2019 Female
4  .15 to 19 years     120079.0     119961.0     119931.0
5  .20 to 24 years     129680.0     129817.0     129753.0
6  .25 to 29 years     146779.0     148179.0     148954.0
7  .30 to 34 years     143994.0     145130.0     147583.0
8  .35 to 39 years     143044.0     145875.0     147830.0
9  .40 to 44 years     128065.0     130622.0     133794.0

In [169]:
Oregon_precovid_Pop= round(Oregon_Female.sum(axis=1).mean())
Oregon_precovid_Pop

409845

In [170]:
Pennsylvania= pd.read_excel('../data/Population/Pennsylvania.xlsx',skiprows=4)
Pennsylvania.head(1)

,Unnamed: 0,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,12702379.0,6190363.0,6512016.0,12702868.0,6190666.0,6512202.0,12711160.0,6195979.0,6515181.0,12745815.0,6217664.0,6528151.0,12767118.0,6234660.0,6532458.0,12776309.0,6245137.0,6531172.0,12788313.0,6253604.0,6534709.0,12784826.0,6256350.0,6528476.0,12782275.0,6258308.0,6523967.0,12787641.0,6261958.0,6525683.0,12800922.0,6271541.0,6529381.0,12801989.0,6274361.0,6527628.0

In [171]:
Pennsylvania_Female=Pennsylvania[['Unnamed: 0','2017 Female','2018 Female','2019 Female']].iloc[4:10]
Pennsylvania_Female

        Unnamed: 0  2017 Female  2018 Female  2019 Female
4  .15 to 19 years     398904.0     396885.0     394792.0
5  .20 to 24 years     406527.0     399759.0     393213.0
6  .25 to 29 years     425450.0     424643.0     420562.0
7  .30 to 34 years     402907.0     408944.0     417238.0
8  .35 to 39 years     384496.0     390671.0     394437.0
9  .40 to 44 years     358858.0     359390.0     362651.0

In [172]:
Pennsylvania_precovid_Pop= round(Pennsylvania_Female.sum(axis=1).mean())
Pennsylvania_precovid_Pop

1190054

In [173]:
Rhode_Island= pd.read_excel('../data/Population/Rhode Island.xlsx',skiprows=4)
Rhode_Island.head(1)

,Unnamed: 0,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,1052567.0,508400.0,544167.0,1052964.0,508655.0,544309.0,1053959.0,509274.0,544685.0,1053649.0,509670.0,543979.0,1054621.0,510615.0,544006.0,1055081.0,511221.0,543860.0,1055936.0,512199.0,543737.0,1056065.0,512878.0,543187.0,1056770.0,513683.0,543087.0,1055673.0,513231.0,542442.0,1058287.0,514860.0,543427.0,1059361.0,515675.0,543686.0

In [174]:
Rhode_Island_Female=Rhode_Island[['Unnamed: 0','2017 Female','2018 Female','2019 Female']].iloc[4:10]
Rhode_Island_Female

        Unnamed: 0  2017 Female  2018 Female  2019 Female
4  .15 to 19 years      36197.0      35994.0      35762.0
5  .20 to 24 years      38698.0      38039.0      37494.0
6  .25 to 29 years      37130.0      37333.0      36767.0
7  .30 to 34 years      33633.0      34453.0      35743.0
8  .35 to 39 years      32040.0      32546.0      32856.0
9  .40 to 44 years      29828.0      29772.0      29924.0

In [175]:
Rhode_Island_precovid_Pop= round(Rhode_Island_Female.sum(axis=1).mean())
Rhode_Island_precovid_Pop

104035

In [176]:
South_Carolina= pd.read_excel('../data/Population/South Carolina.xlsx',skiprows=4)
South_Carolina.head(1)

,Unnamed: 0,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,4625364.0,2250101.0,2375263.0,4625366.0,2250100.0,2375266.0,4635649.0,2254831.0,2380818.0,4671994.0,2271178.0,2400816.0,4717354.0,2292598.0,2424756.0,4764080.0,2314915.0,2449165.0,4823617.0,2342924.0,2480693.0,4891938.0,2375801.0,2516137.0,4957968.0,2406644.0,2551324.0,5021268.0,2435802.0,2585466.0,5084156.0,2463765.0,2620391.0,5148714.0,2493139.0,2655575.0

In [177]:
South_Carolina_Female=South_Carolina[['Unnamed: 0','2017 Female','2018 Female','2019 Female']].iloc[4:10]
South_Carolina_Female

        Unnamed: 0  2017 Female  2018 Female  2019 Female
4  .15 to 19 years     157401.0     158142.0     158802.0
5  .20 to 24 years     161856.0     160414.0     160292.0
6  .25 to 29 years     177295.0     178760.0     177577.0
7  .30 to 34 years     159768.0     162717.0     168416.0
8  .35 to 39 years     158811.0     162196.0     164484.0
9  .40 to 44 years     150827.0     152024.0     154610.0

In [178]:
South_Carolina_precovid_Pop= round(South_Carolina_Female.sum(axis=1).mean())
South_Carolina_precovid_Pop

487399

In [179]:
South_Dakota= pd.read_excel('../data/Population/South_Dakota.xlsx',skiprows=4)
South_Dakota.head(1)

,Unnamed: 0,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,814180.0,407381.0,406799.0,814198.0,407388.0,406810.0,816166.0,408434.0,407732.0,823579.0,413361.0,410218.0,833566.0,419070.0,414496.0,842316.0,423751.0,418565.0,849129.0,427479.0,421650.0,853988.0,430255.0,423733.0,862996.0,435219.0,427777.0,872868.0,440647.0,432221.0,878698.0,443493.0,435205.0,884659.0,446757.0,437902.0

In [180]:
South_Dakota_Female=South_Dakota[['Unnamed: 0','2017 Female','2018 Female','2019 Female']].iloc[4:10]
South_Dakota_Female

        Unnamed: 0  2017 Female  2018 Female  2019 Female
4  .15 to 19 years      27546.0      27691.0      27955.0
5  .20 to 24 years      28966.0      28655.0      28355.0
6  .25 to 29 years      27481.0      27354.0      27371.0
7  .30 to 34 years      27299.0      27419.0      27354.0
8  .35 to 39 years      26496.0      26879.0      27301.0
9  .40 to 44 years      22444.0      23077.0      23753.0

In [181]:
South_Dakota_precovid_Pop= round(South_Dakota_Female.sum(axis=1).mean())
South_Dakota_precovid_Pop

80566

In [182]:
Tennessee= pd.read_excel('../data/Population/Tennessee.xlsx',skiprows=4)
Tennessee.head(1)

,Unnamed: 0,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,6346105.0,3093504.0,3252601.0,6346276.0,3093550.0,3252726.0,6355311.0,3097846.0,3257465.0,6399291.0,3118831.0,3280460.0,6453898.0,3146702.0,3307196.0,6494340.0,3166650.0,3327690.0,6541223.0,3190496.0,3350727.0,6591170.0,3214963.0,3376207.0,6646010.0,3241905.0,3404105.0,6708799.0,3274003.0,3434796.0,6771631.0,3304710.0,3466921.0,6829174.0,3332239.0,3496935.0

In [183]:
Tennessee_Female=Tennessee[['Unnamed: 0','2017 Female','2018 Female','2019 Female']].iloc[4:10]
Tennessee_Female

        Unnamed: 0  2017 Female  2018 Female  2019 Female
4  .15 to 19 years     207355.0     208050.0     207809.0
5  .20 to 24 years     220496.0     220280.0     219838.0
6  .25 to 29 years     241947.0     246204.0     247960.0
7  .30 to 34 years     218472.0     222150.0     228129.0
8  .35 to 39 years     216264.0     219172.0     220743.0
9  .40 to 44 years     206207.0     206699.0     209382.0

In [184]:
Tennessee_precovid_Pop= round(Tennessee_Female.sum(axis=1).mean())
Tennessee_precovid_Pop

661193

In [185]:
Texas= pd.read_excel('../data/Population/Texas.xlsx',skiprows=4)
Texas.head(1)

,Unnamed: 0,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,25145561.0,12472280.0,12673281.0,25146091.0,12472552.0,12673539.0,25241971.0,12520270.0,12721701.0,25645629.0,12719868.0,12925761.0,26084481.0,12942799.0,13141682.0,26480266.0,13142642.0,13337624.0,26964333.0,13386873.0,13577460.0,27470056.0,13643775.0,13826281.0,27914410.0,13865511.0,14048899.0,28295273.0,14055744.0,14239529.0,28628666.0,14219315.0,14409351.0,28995881.0,14402702.0,14593179.0

In [186]:
Texas_Female=Texas[['Unnamed: 0','2017 Female','2018 Female','2019 Female']].iloc[4:10]
Texas_Female

        Unnamed: 0  2017 Female  2018 Female  2019 Female
4  .15 to 19 years     980625.0     993212.0    1004804.0
5  .20 to 24 years     964350.0     965785.0     972342.0
6  .25 to 29 years    1041654.0    1053465.0    1061442.0
7  .30 to 34 years    1012789.0    1019657.0    1035196.0
8  .35 to 39 years     983894.0    1006697.0    1024702.0
9  .40 to 44 years     917866.0     925216.0     938809.0

In [187]:
Texas_precovid_Pop= round(Texas_Female.sum(axis=1).mean())
Texas_precovid_Pop

2983751

In [188]:
Utah= pd.read_excel('../data/Population/Utah.xlsx',skiprows=4)
Utah.head(1)

,Unnamed: 0,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,2763885.0,1388317.0,1375568.0,2763891.0,1388319.0,1375572.0,2775332.0,1394096.0,1381236.0,2814384.0,1413827.0,1400557.0,2853375.0,1434382.0,1418993.0,2897640.0,1457109.0,1440531.0,2936879.0,1477013.0,1459866.0,2981835.0,1500291.0,1481544.0,3041868.0,1531131.0,1510737.0,3101042.0,1561796.0,1539246.0,3153550.0,1588240.0,1565310.0,3205958.0,1614917.0,1591041.0

In [189]:
Utah_Female=Utah[['Unnamed: 0','2017 Female','2018 Female','2019 Female']].iloc[4:10]
Utah_Female

        Unnamed: 0  2017 Female  2018 Female  2019 Female
4  .15 to 19 years     119032.0     121760.0     124535.0
5  .20 to 24 years     124080.0     126177.0     128846.0
6  .25 to 29 years     117036.0     119908.0     122197.0
7  .30 to 34 years     107874.0     107512.0     108654.0
8  .35 to 39 years     112609.0     113870.0     113907.0
9  .40 to 44 years      94768.0      99604.0     104121.0

In [190]:
Utah_precovid_Pop= round(Utah_Female.sum(axis=1).mean())
Utah_precovid_Pop

344415

In [191]:
Vermont= pd.read_excel('../data/Population/Vermont.xlsx',skiprows=4)
Vermont.head(1)

,Unnamed: 0,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,625741.0,308206.0,317535.0,625737.0,308207.0,317530.0,625879.0,308263.0,317616.0,627049.0,309164.0,317885.0,626090.0,308729.0,317361.0,626210.0,308989.0,317221.0,625214.0,308522.0,316692.0,625216.0,308681.0,316535.0,623657.0,308052.0,315605.0,624344.0,308308.0,316036.0,624358.0,308279.0,316079.0,623989.0,308316.0,315673.0

In [192]:
Vermont_Female=Vermont[['Unnamed: 0','2017 Female','2018 Female','2019 Female']].iloc[4:10]
Vermont_Female

        Unnamed: 0  2017 Female  2018 Female  2019 Female
4  .15 to 19 years      20591.0      20342.0      20014.0
5  .20 to 24 years      22614.0      22330.0      22106.0
6  .25 to 29 years      17718.0      18098.0      18281.0
7  .30 to 34 years      18147.0      18071.0      18079.0
8  .35 to 39 years      18197.0      18581.0      18672.0
9  .40 to 44 years      17026.0      17090.0      17380.0

In [193]:
Vermont_precovid_Pop= round(Vermont_Female.sum(axis=1).mean())
Vermont_precovid_Pop

57223

In [194]:
Virginia= pd.read_excel('../data/Population/Virginia.xlsx',skiprows=4)
Virginia.head(1)

,Unnamed: 0,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,8001024.0,3925983.0,4075041.0,8001049.0,3925994.0,4075055.0,8023699.0,3938126.0,4085573.0,8101155.0,3978133.0,4123022.0,8185080.0,4021074.0,4164006.0,8252427.0,4056505.0,4195922.0,8310993.0,4086992.0,4224001.0,8361808.0,4113945.0,4247863.0,8410106.0,4137846.0,4272260.0,8463587.0,4165455.0,4298132.0,8501286.0,4183261.0,4318025.0,8535519.0,4200257.0,4335262.0

In [195]:
Virginia_Female=Virginia[['Unnamed: 0','2017 Female','2018 Female','2019 Female']].iloc[4:10]
Virginia_Female

        Unnamed: 0  2017 Female  2018 Female  2019 Female
4  .15 to 19 years     265449.0     266410.0     266936.0
5  .20 to 24 years     280558.0     277292.0     274705.0
6  .25 to 29 years     294626.0     295285.0     294497.0
7  .30 to 34 years     290135.0     289999.0     291993.0
8  .35 to 39 years     284483.0     289003.0     290813.0
9  .40 to 44 years     263480.0     264495.0     267829.0

In [196]:
Virginia_precovid_Pop= round(Virginia_Female.sum(axis=1).mean())
Virginia_precovid_Pop

841331

In [197]:
Washington= pd.read_excel('../data/Population/Washington.xlsx',skiprows=4)
Washington.head(1)

,Unnamed: 0,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,6724540.0,3349707.0,3374833.0,6724540.0,3349706.0,3374834.0,6742830.0,3358424.0,3384406.0,6826627.0,3402585.0,3424042.0,6897058.0,3438804.0,3458254.0,6963985.0,3474166.0,3489819.0,7054655.0,3522804.0,3531851.0,7163657.0,3578959.0,3584698.0,7294771.0,3647515.0,3647256.0,7423362.0,3713498.0,3709864.0,7523869.0,3764951.0,3758918.0,7614893.0,3811983.0,3802910.0

In [198]:
Washington_Female=Washington[['Unnamed: 0','2017 Female','2018 Female','2019 Female']].iloc[4:10]
Washington_Female

        Unnamed: 0  2017 Female  2018 Female  2019 Female
4  .15 to 19 years     216978.0     217815.0     219326.0
5  .20 to 24 years     230243.0     229804.0     228994.0
6  .25 to 29 years     276410.0     281682.0     283289.0
7  .30 to 34 years     267296.0     273269.0     280561.0
8  .35 to 39 years     254338.0     262330.0     268981.0
9  .40 to 44 years     225734.0     230289.0     236106.0

In [199]:
Washington_precovid_Pop= round(Washington_Female.sum(axis=1).mean())
Washington_precovid_Pop

747241

In [200]:
West_Virginia= pd.read_excel('../data/Population/West Virginia.xlsx',skiprows=4)
West_Virginia.head(1)

,Unnamed: 0,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,1852994.0,913586.0,939408.0,1853018.0,913599.0,939419.0,1854239.0,914308.0,939931.0,1856301.0,915962.0,940339.0,1856872.0,916939.0,939933.0,1853914.0,916007.0,937907.0,1849489.0,913729.0,935760.0,1842050.0,910841.0,931209.0,1831023.0,905614.0,925409.0,1817004.0,899447.0,917557.0,1804291.0,893309.0,910982.0,1792147.0,887770.0,904377.0

In [201]:
West_Virginia_Female=West_Virginia[['Unnamed: 0','2017 Female','2018 Female','2019 Female']].iloc[4:10]
West_Virginia_Female

        Unnamed: 0  2017 Female  2018 Female  2019 Female
4  .15 to 19 years      52176.0      51588.0      51164.0
5  .20 to 24 years      55654.0      54544.0      53747.0
6  .25 to 29 years      55205.0      55162.0      54214.0
7  .30 to 34 years      50390.0      49401.0      49648.0
8  .35 to 39 years      54807.0      54254.0      52788.0
9  .40 to 44 years      54045.0      53490.0      53513.0

In [202]:
West_Virginia_precovid_Pop= round(West_Virginia_Female.sum(axis=1).mean())
West_Virginia_precovid_Pop

159298

In [203]:
Wisconsin= pd.read_excel('../data/Population/Wisconsin.xlsx',skiprows=4)
Wisconsin.head(1)

,Unnamed: 0,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,5686986.0,2822400.0,2864586.0,5687285.0,2822486.0,2864799.0,5690475.0,2824176.0,2866299.0,5705288.0,2831955.0,2873333.0,5719960.0,2840055.0,2879905.0,5736754.0,2848930.0,2887824.0,5751525.0,2857242.0,2894283.0,5760940.0,2863499.0,2897441.0,5772628.0,2870266.0,2902362.0,5790186.0,2879510.0,2910676.0,5807406.0,2889225.0,2918181.0,5822434.0,2897209.0,2925225.0

In [204]:
Wisconsin_Female=Wisconsin[['Unnamed: 0','2017 Female','2018 Female','2019 Female']].iloc[4:10]
Wisconsin_Female

        Unnamed: 0  2017 Female  2018 Female  2019 Female
4  .15 to 19 years     185927.0     185180.0     184817.0
5  .20 to 24 years     197161.0     194339.0     191799.0
6  .25 to 29 years     177297.0     180914.0     184099.0
7  .30 to 34 years     180426.0     178164.0     176616.0
8  .35 to 39 years     180100.0     183375.0     184899.0
9  .40 to 44 years     162476.0     164373.0     167473.0

In [205]:
Wisconsin_precovid_Pop= round(Wisconsin_Female.sum(axis=1).mean())
Wisconsin_precovid_Pop

543239

In [206]:
Wyoming= pd.read_excel('../data/Population/Wyoming.xlsx',skiprows=4)
Wyoming.head(1)

,Unnamed: 0,Both Sexes,Male,Female,Both Sexes.1,Male.1,Female.1,Both Sexes.2,Male.2,Female.2,Both Sexes.3,Male.3,Female.3,Both Sexes.4,Male.4,Female.4,Both Sexes.5,Male.5,Female.5,Both Sexes.6,Male.6,Female.6,Both Sexes.7,Male.7,Female.7,Both Sexes.8,Male.8,Female.8,Both Sexes.9,Male.9,2017 Female,Both Sexes.10,Male.10,2018 Female,Both Sexes.11,Male.11,2019 Female
0,Total,563626.0,287437.0,276189.0,563775.0,287471.0,276304.0,564487.0,287785.0,276702.0,567299.0,289263.0,278036.0,576305.0,294286.0,282019.0,582122.0,297231.0,284891.0,582531.0,297390.0,285141.0,585613.0,299246.0,286367.0,584215.0,298397.0,285818.0,578931.0,295265.0,283666.0,577601.0,294276.0,283325.0,578759.0,294730.0,284029.0

In [207]:
Wyoming_Female=Wyoming[['Unnamed: 0','2017 Female','2018 Female','2019 Female']].iloc[4:10]
Wyoming_Female

        Unnamed: 0  2017 Female  2018 Female  2019 Female
4  .15 to 19 years      17312.0      17314.0      17449.0
5  .20 to 24 years      18271.0      18033.0      17934.0
6  .25 to 29 years      18851.0      18700.0      18333.0
7  .30 to 34 years      19210.0      18641.0      18425.0
8  .35 to 39 years      18453.0      18930.0      19211.0
9  .40 to 44 years      15882.0      16091.0      16592.0

In [208]:
Wyoming_precovid_Pop= round(Wyoming_Female.sum(axis=1).mean())
Wyoming_precovid_Pop

53939

In [209]:
pre_covid_winter.loc[[0],['Female_Pop_Avg']]=Alabama_PreCovid_Pop_Avg
pre_covid_winter.loc[[1],['Female_Pop_Avg']]=Arizona_precovid_Pop
pre_covid_winter.loc[[2],['Female_Pop_Avg']]=Arkansas_PreCovid_Pop_Avg
pre_covid_winter.loc[[3],['Female_Pop_Avg']]=California_Female
pre_covid_winter.loc[[4],['Female_Pop_Avg']]=Colorado_Female
pre_covid_winter.loc[[5],['Female_Pop_Avg']]=Connecticut_precovid_Pop
pre_covid_winter.loc[[6],['Female_Pop_Avg']]=Delaware_precovid_Pop
pre_covid_winter.loc[[7],['Female_Pop_Avg']]=Florida_precovid_Pop
pre_covid_winter.loc[[8],['Female_Pop_Avg']]=Georgia_precovid_Pop
pre_covid_winter.loc[[9],['Female_Pop_Avg']]=Idaho_precovid_Pop
pre_covid_winter.loc[[10],['Female_Pop_Avg']]=Illinois_precovid_Pop
pre_covid_winter.loc[[11],['Female_Pop_Avg']]=Indiana_precovid_Pop
pre_covid_winter.loc[[12],['Female_Pop_Avg']]=Iowa_precovid_Pop
pre_covid_winter.loc[[13],['Female_Pop_Avg']]=Kansas_precovid_Pop
pre_covid_winter.loc[[14],['Female_Pop_Avg']]=Kentucky_precovid_Pop
pre_covid_winter.loc[[15],['Female_Pop_Avg']]=Louisiana_precovid_Pop
pre_covid_winter.loc[[16],['Female_Pop_Avg']]=Maine_precovid_Pop
pre_covid_winter.loc[[17],['Female_Pop_Avg']]=Maryland_precovid_Pop
pre_covid_winter.loc[[18],['Female_Pop_Avg']]=Massachusetts_precovid_Pop
pre_covid_winter.loc[[19],['Female_Pop_Avg']]=Michigan_precovid_Pop
pre_covid_winter.loc[[20],['Female_Pop_Avg']]=Minnesota_precovid_Pop
pre_covid_winter.loc[[21],['Female_Pop_Avg']]=Mississippi_precovid_Pop
pre_covid_winter.loc[[22],['Female_Pop_Avg']]=Missouri_precovid_Pop
pre_covid_winter.loc[[23],['Female_Pop_Avg']]=Montana_precovid_Pop
pre_covid_winter.loc[[24],['Female_Pop_Avg']]=Nebraska_precovid_Pop
pre_covid_winter.loc[[25],['Female_Pop_Avg']]=Nevada_precovid_Pop
pre_covid_winter.loc[[26],['Female_Pop_Avg']]=New_Hampshire_precovid_Pop
pre_covid_winter.loc[[27],['Female_Pop_Avg']]=New_Jersey_precovid_Pop
pre_covid_winter.loc[[28],['Female_Pop_Avg']]=New_Mexico_precovid_Pop
pre_covid_winter.loc[[29],['Female_Pop_Avg']]=New_York_precovid_Pop
pre_covid_winter.loc[[30],['Female_Pop_Avg']]=North_Carolina_precovid_Pop
pre_covid_winter.loc[[31],['Female_Pop_Avg']]=North_Dakota_precovid_Pop
pre_covid_winter.loc[[32],['Female_Pop_Avg']]=Ohio_precovid_Pop
pre_covid_winter.loc[[33],['Female_Pop_Avg']]=Oklahoma_precovid_Pop
pre_covid_winter.loc[[34],['Female_Pop_Avg']]=Oregon_precovid_Pop
pre_covid_winter.loc[[35],['Female_Pop_Avg']]=Pennsylvania_precovid_Pop
pre_covid_winter.loc[[36],['Female_Pop_Avg']]=Rhode_Island_precovid_Pop
pre_covid_winter.loc[[37],['Female_Pop_Avg']]=South_Carolina_precovid_Pop
pre_covid_winter.loc[[38],['Female_Pop_Avg']]=South_Dakota_precovid_Pop
pre_covid_winter.loc[[39],['Female_Pop_Avg']]=Tennessee_precovid_Pop
pre_covid_winter.loc[[40],['Female_Pop_Avg']]=Texas_precovid_Pop
pre_covid_winter.loc[[41],['Female_Pop_Avg']]=Utah_precovid_Pop
pre_covid_winter.loc[[42],['Female_Pop_Avg']]=Vermont_precovid_Pop
pre_covid_winter.loc[[43],['Female_Pop_Avg']]=Virginia_precovid_Pop
pre_covid_winter.loc[[44],['Female_Pop_Avg']]=Washington_precovid_Pop
pre_covid_winter.loc[[45],['Female_Pop_Avg']]=West_Virginia_precovid_Pop
pre_covid_winter.loc[[46],['Female_Pop_Avg']]=Wisconsin_precovid_Pop
pre_covid_winter.loc[[47],['Female_Pop_Avg']]=Wyoming_precovid_Pop

C:\Users\Test\lib\site-packages\pandas\core\indexing.py:1720: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_single_column(loc, value, pi)

In [291]:
pre_covid_winter.head()

     Location  Temp_2017  Temp_2018  Temp_2019  Avg_Temp  Female_Pop_Avg
0     Alabama       52.7       48.4       50.5      50.5        474713.0
1     Arizona       45.5       47.0       42.0      44.8        688216.0
2    Arkansas       46.7       41.3       43.7      43.9        288742.0
3  California       44.3       47.7       43.8      45.3       4033837.0
4    Colorado       28.6       29.5       25.8      28.0        579876.0

# Write to CSV

In [290]:
pre_covid_winter.to_csv('../data/pre_covid_Temp_Pop.csv', index = False) # Create a csv file of the Pre COVID winter

In [212]:
colder_winter_states= pre_covid_winter.sort_values(['Avg_Temp']).head(15)
colder_winter_states

         Location  Temp_2017  Temp_2018  Temp_2019  Avg_Temp  Female_Pop_Avg
31   North Dakota       14.0       10.9        9.3      11.4         73647.0
20      Minnesota       17.9       10.8       10.7      13.1        536276.0
38   South Dakota       20.4       17.1       16.5      18.0         80566.0
23        Montana       18.3       18.1       18.3      18.2         96608.0
46      Wisconsin       22.4       16.2       17.2      18.6        543239.0
16          Maine       20.9       18.0       16.9      18.6        115870.0
47        Wyoming       20.4       22.7       20.1      21.1         53939.0
42        Vermont       24.8       20.0       19.0      21.3         57223.0
26  New Hampshire       25.6       21.6       21.2      22.8        122242.0
12           Iowa       27.2       20.9       20.7      22.9        296326.0
19       Michigan       26.7       21.3       21.8      23.3        939298.0
9           Idaho       22.4       27.3       24.6      24.8        168768.0
24       Nebraska       28.0       23.8       23.9      25.2        185814.0
29       New York       28.7       23.7       24.0      25.5       1948733.0
4        Colorado       28.6       29.5       25.8      28.0        579876.0

In [288]:
pre_covid_winter.sort_values(['Avg_Temp'])

          Location  Temp_2017  Temp_2018  Temp_2019  Avg_Temp  Female_Pop_Avg
31    North Dakota       14.0       10.9        9.3      11.4         73647.0
20       Minnesota       17.9       10.8       10.7      13.1        536276.0
38    South Dakota       20.4       17.1       16.5      18.0         80566.0
23         Montana       18.3       18.1       18.3      18.2         96608.0
46       Wisconsin       22.4       16.2       17.2      18.6        543239.0
16           Maine       20.9       18.0       16.9      18.6        115870.0
47         Wyoming       20.4       22.7       20.1      21.1         53939.0
42         Vermont       24.8       20.0       19.0      21.3         57223.0
26   New Hampshire       25.6       21.6       21.2      22.8        122242.0
12            Iowa       27.2       20.9       20.7      22.9        296326.0
19        Michigan       26.7       21.3       21.8      23.3        939298.0
9            Idaho       22.4       27.3       24.6      24.8        168768.0
24        Nebraska       28.0       23.8       23.9      25.2        185814.0
29        New York       28.7       23.7       24.0      25.5       1948733.0
4         Colorado       28.6       29.5       25.8      28.0        579876.0
41            Utah       29.9       32.1       27.2      29.7        344415.0
18   Massachusetts       31.8       28.5       28.8      29.7        694817.0
44      Washington       27.3       32.6       30.9      30.3        747241.0
35    Pennsylvania       33.2       28.5       29.8      30.5       1190054.0
10        Illinois       34.0       28.6       29.7      30.8       1256192.0
5      Connecticut       33.3       29.9       30.3      31.2        335209.0
34          Oregon       29.6       34.5       32.1      32.1        409845.0
11         Indiana       35.0       29.7       31.6      32.1        651214.0
32            Ohio       35.4       30.3       31.8      32.5       1104218.0
36    Rhode Island       34.5       31.8       32.0      32.8        104035.0
13          Kansas       35.3       31.8       31.2      32.8        280283.0
25          Nevada       32.6       35.7       32.0      33.4        295922.0
22        Missouri       37.6       32.6       33.6      34.6        586815.0
27      New Jersey       37.6       33.9       34.7      35.4        838056.0
45   West Virginia       38.4       33.9       35.7      36.0        159298.0
17        Maryland       40.0       36.0       36.9      37.6        592669.0
28      New Mexico       39.8       39.0       36.4      38.4        198816.0
6         Delaware       40.9       37.4       38.5      38.9         89655.0
14        Kentucky       41.4       36.8       39.3      39.2        424075.0
43        Virginia       41.7       38.1       39.3      39.7        841331.0
33        Oklahoma       43.4       39.4       39.8      40.9        385672.0
39       Tennessee       44.9       40.3       42.9      42.7        661193.0
2         Arkansas       46.7       41.3       43.7      43.9        288742.0
1          Arizona       45.5       47.0       42.0      44.8        688216.0
30  North Carolina       46.7       43.4       45.0      45.0       1018908.0
3       California       44.3       47.7       43.8      45.3       4033837.0
37  South Carolina       52.0       48.6       49.4      50.0        487399.0
40           Texas       52.9       48.0       49.1      50.0       2983751.0
21     Mississippi       53.1       48.0       50.1      50.4        293923.0
0          Alabama       52.7       48.4       50.5      50.5        474713.0
8          Georgia       53.9       50.3       51.5      51.9       1080456.0
15       Louisiana       57.7       51.8       53.4      54.3        463386.0
7          Florida       64.7       62.0       62.6      63.1       1930457.0

In [213]:
colder_winter_states= colder_winter_states.sort_values(['Female_Pop_Avg'],ascending= False)
colder_winter_states

         Location  Temp_2017  Temp_2018  Temp_2019  Avg_Temp  Female_Pop_Avg
29       New York       28.7       23.7       24.0      25.5       1948733.0
19       Michigan       26.7       21.3       21.8      23.3        939298.0
4        Colorado       28.6       29.5       25.8      28.0        579876.0
46      Wisconsin       22.4       16.2       17.2      18.6        543239.0
20      Minnesota       17.9       10.8       10.7      13.1        536276.0
12           Iowa       27.2       20.9       20.7      22.9        296326.0
24       Nebraska       28.0       23.8       23.9      25.2        185814.0
9           Idaho       22.4       27.3       24.6      24.8        168768.0
26  New Hampshire       25.6       21.6       21.2      22.8        122242.0
16          Maine       20.9       18.0       16.9      18.6        115870.0
23        Montana       18.3       18.1       18.3      18.2         96608.0
38   South Dakota       20.4       17.1       16.5      18.0         80566.0
31   North Dakota       14.0       10.9        9.3      11.4         73647.0
42        Vermont       24.8       20.0       19.0      21.3         57223.0
47        Wyoming       20.4       22.7       20.1      21.1         53939.0

In [214]:
colder_winter_states = colder_winter_states.loc[[29,19,20]]
colder_winter_states

     Location  Temp_2017  Temp_2018  Temp_2019  Avg_Temp  Female_Pop_Avg
29   New York       28.7       23.7       24.0      25.5       1948733.0
19   Michigan       26.7       21.3       21.8      23.3        939298.0
20  Minnesota       17.9       10.8       10.7      13.1        536276.0

In [215]:
warmer_winter_states= pre_covid_winter.sort_values(['Avg_Temp'],ascending=False).head(15)

In [216]:
warmer_winter_states.sort_values(['Female_Pop_Avg'], ascending=False)

          Location  Temp_2017  Temp_2018  Temp_2019  Avg_Temp  Female_Pop_Avg
3       California       44.3       47.7       43.8      45.3       4033837.0
40           Texas       52.9       48.0       49.1      50.0       2983751.0
7          Florida       64.7       62.0       62.6      63.1       1930457.0
8          Georgia       53.9       50.3       51.5      51.9       1080456.0
30  North Carolina       46.7       43.4       45.0      45.0       1018908.0
43        Virginia       41.7       38.1       39.3      39.7        841331.0
1          Arizona       45.5       47.0       42.0      44.8        688216.0
39       Tennessee       44.9       40.3       42.9      42.7        661193.0
37  South Carolina       52.0       48.6       49.4      50.0        487399.0
0          Alabama       52.7       48.4       50.5      50.5        474713.0
15       Louisiana       57.7       51.8       53.4      54.3        463386.0
14        Kentucky       41.4       36.8       39.3      39.2        424075.0
33        Oklahoma       43.4       39.4       39.8      40.9        385672.0
21     Mississippi       53.1       48.0       50.1      50.4        293923.0
2         Arkansas       46.7       41.3       43.7      43.9        288742.0

In [217]:
warmer_winter_states= warmer_winter_states.loc[[7,30,37]]
warmer_winter_states

          Location  Temp_2017  Temp_2018  Temp_2019  Avg_Temp  Female_Pop_Avg
7          Florida       64.7       62.0       62.6      63.1       1930457.0
30  North Carolina       46.7       43.4       45.0      45.0       1018908.0
37  South Carolina       52.0       48.6       49.4      50.0        487399.0

<div class="alert alert-info alertdanger" style="margin-top: 20px">
<b>Warmer States are Florida, North Carolina, South Carolina
    
<b>Colder States are New York, Michigan, Minnesota</b>
        </div>

### Gathering the birth stats for the pre COVID colder_winter_states (New York,Michigan,Minnesota)

In [218]:
Pre_Cov_birth_Stats= pd.read_csv('../data/Winter_PreCovid_birth/Colder_Natality_2017-2019.csv')
Pre_Cov_birth_Stats

        State  State Code  Year  Year Code      Month  Month Code  Births
0    Michigan          26  2017       2017    January           1    8991
1    Michigan          26  2017       2017   February           2    8385
2    Michigan          26  2017       2017      March           3    9327
3    Michigan          26  2017       2017      April           4    8807
4    Michigan          26  2017       2017        May           5    9596
..        ...         ...   ...        ...        ...         ...     ...
103  New York          36  2019       2019     August           8   19951
104  New York          36  2019       2019  September           9   19073
105  New York          36  2019       2019    October          10   18748
106  New York          36  2019       2019   November          11   17609
107  New York          36  2019       2019   December          12   18079

[108 rows x 7 columns]

In [219]:
Minnesota= Pre_Cov_birth_Stats.loc[Pre_Cov_birth_Stats['State']=='Minnesota']

In [220]:
Minnesota.head()

        State  State Code  Year  Year Code     Month  Month Code  Births
36  Minnesota          27  2017       2017   January           1    5362
37  Minnesota          27  2017       2017  February           2    5106
38  Minnesota          27  2017       2017     March           3    5764
39  Minnesota          27  2017       2017     April           4    5593
40  Minnesota          27  2017       2017       May           5    6104

In [221]:
Minnesota.dtypes

State         object
State Code     int64
Year           int64
Year Code      int64
Month         object
Month Code     int64
Births         int64
dtype: object

In [222]:
Minnesota_Births= Minnesota.loc[(Minnesota['Month']=='August') | (Minnesota['Month']=='September') | (Minnesota['Month']=='October')  |(Minnesota['Month']=='November')]                            
Minnesota_Births.head()

        State  State Code  Year  Year Code      Month  Month Code  Births
43  Minnesota          27  2017       2017     August           8    6174
44  Minnesota          27  2017       2017  September           9    5812
45  Minnesota          27  2017       2017    October          10    5658
46  Minnesota          27  2017       2017   November          11    5375
55  Minnesota          27  2018       2018     August           8    6201

In [223]:
Minnesota_Births_Avg = round(Minnesota_Births['Births'].mean())
Minnesota_Births_Avg

5669

In [224]:
Michigan= Pre_Cov_birth_Stats.loc[Pre_Cov_birth_Stats['State']=='Michigan']
Michigan.head()

      State  State Code  Year  Year Code     Month  Month Code  Births
0  Michigan          26  2017       2017   January           1    8991
1  Michigan          26  2017       2017  February           2    8385
2  Michigan          26  2017       2017     March           3    9327
3  Michigan          26  2017       2017     April           4    8807
4  Michigan          26  2017       2017       May           5    9596

In [225]:
Michigan_Births= Michigan.loc[(Michigan['Month']=='August') | (Michigan['Month']=='September') | (Michigan['Month']=='October')  |(Michigan['Month']=='November')]                            
Michigan_Births.head()

       State  State Code  Year  Year Code      Month  Month Code  Births
7   Michigan          26  2017       2017     August           8   10188
8   Michigan          26  2017       2017  September           9    9511
9   Michigan          26  2017       2017    October          10    9251
10  Michigan          26  2017       2017   November          11    8817
19  Michigan          26  2018       2018     August           8    9898

In [226]:
Michigan_Births_Avg = round(Michigan_Births['Births'].mean())
Michigan_Births_Avg

9268

In [227]:
New_York= Pre_Cov_birth_Stats.loc[Pre_Cov_birth_Stats['State']=='New York']
New_York.head()

       State  State Code  Year  Year Code     Month  Month Code  Births
72  New York          36  2017       2017   January           1   18481
73  New York          36  2017       2017  February           2   17154
74  New York          36  2017       2017     March           3   18903
75  New York          36  2017       2017     April           4   18200
76  New York          36  2017       2017       May           5   19164

In [228]:
New_York_Births= New_York.loc[(New_York['Month']=='August') | (New_York['Month']=='September') | (New_York['Month']=='October')  |(New_York['Month']=='November')].reset_index()                          
New_York_Births.head()

   index     State  State Code  Year  Year Code      Month  Month Code  Births
0     79  New York          36  2017       2017     August           8   20425
1     80  New York          36  2017       2017  September           9   19758
2     81  New York          36  2017       2017    October          10   19560
3     82  New York          36  2017       2017   November          11   18874
4     91  New York          36  2018       2018     August           8   20179

In [229]:
New_York_Births_Births_Avg = round(New_York_Births['Births'].mean())
New_York_Births_Births_Avg

19200

In [230]:
colder_winter_states.loc[[29],['Birth_Avg']]=New_York_Births_Births_Avg
colder_winter_states.loc[[19],['Birth_Avg']]=Michigan_Births_Avg
colder_winter_states.loc[[20],['Birth_Avg']]=Minnesota_Births_Avg
colder_winter_states

,Location,Temp_2017,Temp_2018,Temp_2019,Avg_Temp,Female_Pop_Avg,Birth_Avg
29,New York,28.7,23.7,24.0,25.5,1948733.0,19200.0
19,Michigan,26.7,21.3,21.8,23.3,939298.0,9268.0
20,Minnesota,17.9,10.8,10.7,13.1,536276.0,5669.0

### Warmer States Pre COVID child birth Info

In [231]:
Warmer_Natality_Stats= pd.read_csv('../data/Winter_PreCovid_birth/Warmer_Natality_2017-2019.csv')
Warmer_Natality_Stats.head()

     State  State Code  Year  Year Code     Month  Month Code  Births
0  Florida          12  2017       2017   January           1   18511
1  Florida          12  2017       2017  February           2   16984
2  Florida          12  2017       2017     March           3   18265
3  Florida          12  2017       2017     April           4   16787
4  Florida          12  2017       2017       May           5   17665

In [232]:
Florida= Warmer_Natality_Stats.loc[Warmer_Natality_Stats['State']=='Florida']
Florida.head()

     State  State Code  Year  Year Code     Month  Month Code  Births
0  Florida          12  2017       2017   January           1   18511
1  Florida          12  2017       2017  February           2   16984
2  Florida          12  2017       2017     March           3   18265
3  Florida          12  2017       2017     April           4   16787
4  Florida          12  2017       2017       May           5   17665

In [233]:
Florida_Births= Florida.loc[(Florida['Month']=='August') | (Florida['Month']=='September') | (Florida['Month']=='October')  |(Florida['Month']=='November')]                      
Florida_Births.head()

      State  State Code  Year  Year Code      Month  Month Code  Births
7   Florida          12  2017       2017     August           8   20373
8   Florida          12  2017       2017  September           9   19396
9   Florida          12  2017       2017    October          10   19551
10  Florida          12  2017       2017   November          11   19043
19  Florida          12  2018       2018     August           8   20095

In [234]:
Florida_Births_Avg = round(Florida_Births['Births'].mean())
Florida_Births_Avg

19377

In [235]:
North_Carolina= Warmer_Natality_Stats.loc[Warmer_Natality_Stats['State']=='North Carolina']
North_Carolina.head()

             State  State Code  Year  Year Code     Month  Month Code  Births
36  North Carolina          37  2017       2017   January           1    9645
37  North Carolina          37  2017       2017  February           2    8909
38  North Carolina          37  2017       2017     March           3    9845
39  North Carolina          37  2017       2017     April           4    9122
40  North Carolina          37  2017       2017       May           5    9776

In [236]:
North_Carolina_Births= North_Carolina.loc[(North_Carolina['Month']=='August') | (North_Carolina['Month']=='September') | (North_Carolina['Month']=='October')  |(North_Carolina['Month']=='November')]                      
North_Carolina_Births.head()

             State  State Code  Year  Year Code      Month  Month Code  Births
43  North Carolina          37  2017       2017     August           8   11168
44  North Carolina          37  2017       2017  September           9   10655
45  North Carolina          37  2017       2017    October          10   10239
46  North Carolina          37  2017       2017   November          11   10087
55  North Carolina          37  2018       2018     August           8   10901

In [237]:
North_Carolina_Births_Births_Avg = round(North_Carolina_Births['Births'].mean())
North_Carolina_Births_Births_Avg

10354

In [238]:
South_Carolina= Warmer_Natality_Stats.loc[Warmer_Natality_Stats['State']=='South Carolina']
South_Carolina.head()

             State  State Code  Year  Year Code     Month  Month Code  Births
72  South Carolina          45  2017       2017   January           1    4675
73  South Carolina          45  2017       2017  February           2    4301
74  South Carolina          45  2017       2017     March           3    4775
75  South Carolina          45  2017       2017     April           4    4265
76  South Carolina          45  2017       2017       May           5    4631

In [239]:
South_Carolina_Births= South_Carolina.loc[(South_Carolina['Month']=='August') | (South_Carolina['Month']=='September') | (South_Carolina['Month']=='October')  |(South_Carolina['Month']=='November')]                      
South_Carolina_Births.head()

             State  State Code  Year  Year Code      Month  Month Code  Births
79  South Carolina          45  2017       2017     August           8    5338
80  South Carolina          45  2017       2017  September           9    5074
81  South Carolina          45  2017       2017    October          10    4862
82  South Carolina          45  2017       2017   November          11    4728
91  South Carolina          45  2018       2018     August           8    5148

In [240]:
South_Carolina_Births_Avg = round(South_Carolina_Births['Births'].mean())
South_Carolina_Births_Avg

4940

In [241]:
warmer_winter_states

          Location  Temp_2017  Temp_2018  Temp_2019  Avg_Temp  Female_Pop_Avg
7          Florida       64.7       62.0       62.6      63.1       1930457.0
30  North Carolina       46.7       43.4       45.0      45.0       1018908.0
37  South Carolina       52.0       48.6       49.4      50.0        487399.0

In [242]:
warmer_winter_states.loc[[7],['Pre-COVID Birth_Avg']]=Florida_Births_Avg
warmer_winter_states.loc[[30],['Pre-COVID Birth_Avg']]=North_Carolina_Births_Births_Avg
warmer_winter_states.loc[[37],['Pre-COVID Birth_Avg']]=South_Carolina_Births_Avg

In [243]:
warmer_winter_states

,Location,Temp_2017,Temp_2018,Temp_2019,Avg_Temp,Female_Pop_Avg,Pre-COVID Birth_Avg
7,Florida,64.7,62.0,62.6,63.1,1930457.0,19377.0
30,North Carolina,46.7,43.4,45.0,45.0,1018908.0,10354.0
37,South Carolina,52.0,48.6,49.4,50.0,487399.0,4940.0

In [244]:
colder_winter_states

,Location,Temp_2017,Temp_2018,Temp_2019,Avg_Temp,Female_Pop_Avg,Birth_Avg
29,New York,28.7,23.7,24.0,25.5,1948733.0,19200.0
19,Michigan,26.7,21.3,21.8,23.3,939298.0,9268.0
20,Minnesota,17.9,10.8,10.7,13.1,536276.0,5669.0

In [245]:
Winter_states_combined= pd.concat([warmer_winter_states,colder_winter_states]).reset_index()
Winter_states_combined= Winter_states_combined.drop(columns=['index'])
Winter_states_combined

,Location,Temp_2017,Temp_2018,Temp_2019,Avg_Temp,Female_Pop_Avg,Pre-COVID Birth_Avg,Birth_Avg
0,Florida,64.7,62.0,62.6,63.1,1930457.0,19377.0,NaN
1,North Carolina,46.7,43.4,45.0,45.0,1018908.0,10354.0,NaN
2,South Carolina,52.0,48.6,49.4,50.0,487399.0,4940.0,NaN
3,New York,28.7,23.7,24.0,25.5,1948733.0,NaN,19200.0
4,Michigan,26.7,21.3,21.8,23.3,939298.0,NaN,9268.0
5,Minnesota,17.9,10.8,10.7,13.1,536276.0,NaN,5669.0

<div class="alert alert-info alertdanger" style="margin-top: 20px">
    <center>
<h1> COVID Births </h1>
</div>

In [246]:
COVID_Births= pd.read_csv('../data/Covid_Births/COVID_Births_2020.csv')

In [247]:
COVID_Births

             State  State Code  Year  Year Code      Month  Month Code  Births
0          Florida          12  2020       2020    January           1   18132
1          Florida          12  2020       2020   February           2   16691
2          Florida          12  2020       2020      March           3   17149
3          Florida          12  2020       2020      April           4   16504
4          Florida          12  2020       2020        May           5   16845
..             ...         ...   ...        ...        ...         ...     ...
67  South Carolina          45  2020       2020     August           8    4941
68  South Carolina          45  2020       2020  September           9    4892
69  South Carolina          45  2020       2020    October          10    4713
70  South Carolina          45  2020       2020   November          11    4349
71  South Carolina          45  2020       2020   December          12    4796

[72 rows x 7 columns]

In [248]:
COVID_Births_winter = COVID_Births.loc[(COVID_Births['Month']=='August')|(COVID_Births['Month']=='September')|(COVID_Births['Month']=='October')|(COVID_Births['Month']=='November')]

In [249]:
Minnesota_COVID_Births_winter= COVID_Births_winter.loc[COVID_Births_winter['State']=='Minnesota']

Minnesota_COVID_Births_winter_Avg = round(Minnesota_COVID_Births_winter['Births'].mean())

Minnesota_COVID_Births_winter_Avg

5212

In [250]:
Michigan_COVID_Births_winter= COVID_Births_winter.loc[COVID_Births_winter['State']=='Michigan']

Michigan_COVID_Births_winter_Avg = round(Michigan_COVID_Births_winter['Births'].mean())

Michigan_COVID_Births_winter_Avg

8590

In [251]:
New_York_COVID_Births_winter= COVID_Births_winter.loc[COVID_Births_winter['State']=='New York']

New_York_COVID_Births_winter_Avg = round(New_York_COVID_Births_winter['Births'].mean())

New_York_COVID_Births_winter_Avg

17282

In [252]:
South_Carolina_COVID_Births_winter = COVID_Births_winter.loc[COVID_Births_winter['State']=='South Carolina']

South_Carolina_COVID_Births_winter_Avg = round(South_Carolina_COVID_Births_winter['Births'].mean())

South_Carolina_COVID_Births_winter_Avg

4724

In [253]:
Florida_COVID_Births_winter = COVID_Births_winter.loc[COVID_Births_winter['State']=='Florida']

Florida_COVID_Births_winter_Avg = round(Florida_COVID_Births_winter['Births'].mean())

Florida_COVID_Births_winter_Avg

17836

In [254]:
North_Carolina_COVID_Births_winter = COVID_Births_winter.loc[COVID_Births_winter['State']=='North Carolina']

North_Carolina_COVID_Births_winter_Avg = round(North_Carolina_COVID_Births_winter['Births'].mean())

North_Carolina_COVID_Births_winter_Avg

9822

In [255]:
Winter_states_combined.loc[[0],['COIVD_Birth']]=Florida_COVID_Births_winter_Avg
Winter_states_combined.loc[[1],['COIVD_Birth']]=Michigan_COVID_Births_winter_Avg
Winter_states_combined.loc[[2],['COIVD_Birth']]=Minnesota_COVID_Births_winter_Avg
Winter_states_combined.loc[[3],['COIVD_Birth']]=New_York_COVID_Births_winter_Avg
Winter_states_combined.loc[[4],['COIVD_Birth']]=Michigan_COVID_Births_winter_Avg
Winter_states_combined.loc[[5],['COIVD_Birth']]=Minnesota_COVID_Births_winter_Avg

In [256]:
Winter_states_combined

,Location,Temp_2017,Temp_2018,Temp_2019,Avg_Temp,Female_Pop_Avg,Pre-COVID Birth_Avg,Birth_Avg,COIVD_Birth
0,Florida,64.7,62.0,62.6,63.1,1930457.0,19377.0,NaN,17836.0
1,North Carolina,46.7,43.4,45.0,45.0,1018908.0,10354.0,NaN,8590.0
2,South Carolina,52.0,48.6,49.4,50.0,487399.0,4940.0,NaN,5212.0
3,New York,28.7,23.7,24.0,25.5,1948733.0,NaN,19200.0,17282.0
4,Michigan,26.7,21.3,21.8,23.3,939298.0,NaN,9268.0,8590.0
5,Minnesota,17.9,10.8,10.7,13.1,536276.0,NaN,5669.0,5212.0

In [257]:
Winter_states_combined.to_csv('../data/Winter_states_combined.csv', index = False)

In [258]:
# States_Geocode= pd.read_csv('../data/States_Geocode.csv')
# States_Geocode

In [259]:
# Winter_states_combined_LatLong = pd.merge(Winter_states_combined,States_Geocode,how='inner',left_on='Location',right_on ='State').drop(columns=['State'])
# Winter_states_combined_LatLong

In [260]:
#Winter_states_combined_LatLong.to_csv('../data/Winter_states_combined_LatLong.csv', index = False)

<div class="alert alert-info alertdanger" style="margin-top: 20px">
<b>Total Child Births (2017-2020) <b>
  </div>

In [261]:
Child_Brith_OverTime =pd.read_csv('../data/Covid_Births/Child_Brith_OverTime.csv', skiprows=[5])
Child_Brith_OverTime

   Year  Year Code   Births
0  2017       2017  3844260
1  2018       2018  3780401
2  2019       2019  3736144
3  2020       2020  3602653

In [262]:
Child_Brith_OverTime['Births'].pct_change()

0         NaN
1   -0.016612
2   -0.011707
3   -0.035730
Name: Births, dtype: float64

In [263]:
Child_Brith_OverTime['Diff'] = Child_Brith_OverTime['Births'].diff()

In [264]:
Child_Brith_OverTime

   Year  Year Code   Births      Diff
0  2017       2017  3844260       NaN
1  2018       2018  3780401  -63859.0
2  2019       2019  3736144  -44257.0
3  2020       2020  3602653 -133491.0

In [265]:
Child_Brith_OverTime['Pct_change']= Child_Brith_OverTime['Births'].pct_change()

In [266]:
Child_Brith_OverTime

   Year  Year Code   Births      Diff  Pct_change
0  2017       2017  3844260       NaN         NaN
1  2018       2018  3780401  -63859.0   -0.016612
2  2019       2019  3736144  -44257.0   -0.011707
3  2020       2020  3602653 -133491.0   -0.035730

In [267]:
Child_Brith_OverTime.to_csv('../data/Child_Brith_OverTime.csv', index = False)

In [268]:
Pre_Cov_birth_Stats= pd.read_csv('../data/Winter_PreCovid_birth/Colder_Natality_2017-2019.csv')

<div class="alert alert-info alertdanger" style="margin-top: 20px">
    <center>
<h1> Question: Compare births in Hospital vs at Home </h1>

<div class="alert alert-info alertdanger" style="margin-top: 20px">
   
<b> Residential Births <b>

In [269]:
Residential_Births = pd.read_csv('../data/Location/Residential_Births.csv')
Residential_Births

   Year  Births
0  2017   38215
1  2018   38386
2  2019   38378
3  2020   45504

In [270]:
Diff = Residential_Births['Births'].diff()

In [271]:
Residential_Births['Diff']= Diff
Residential_Births

   Year  Births    Diff
0  2017   38215     NaN
1  2018   38386   171.0
2  2019   38378    -8.0
3  2020   45504  7126.0

In [272]:
Residential_Births['Pct_change']= round(Residential_Births['Births'].pct_change(),3)

In [273]:
Residential_Births

   Year  Births    Diff  Pct_change
0  2017   38215     NaN         NaN
1  2018   38386   171.0       0.004
2  2019   38378    -8.0      -0.000
3  2020   45504  7126.0       0.186

In [274]:
Residential_Births.to_csv('../data/Residential_Births.csv', index = False)

<div class="alert alert-info alertdanger" style="margin-top: 20px">
   
<b> Hospital Births <b>

In [275]:
Hospital_Births= pd.read_csv('../data/Location/Hospital_Births.csv')
Hospital_Births

   Year  Year Code   Births
0  2017       2017  3782201
1  2018       2018  3718050
2  2019       2019  3673793
3  2020       2020  3530810

In [276]:
Hospital_Births['Diff']= Hospital_Births['Births'].diff()

In [277]:
Hospital_Births['Pct_change']= round (Hospital_Births['Births'].pct_change(),2)
Hospital_Births

   Year  Year Code   Births      Diff  Pct_change
0  2017       2017  3782201       NaN         NaN
1  2018       2018  3718050  -64151.0       -0.02
2  2019       2019  3673793  -44257.0       -0.01
3  2020       2020  3530810 -142983.0       -0.04

In [278]:
Hospital_Births.to_csv('../data/Hospital_Births.csv', index = False)

<div class="alert alert-info alertdanger" style="margin-top: 20px">
   
<b> Female Population <b>

In [279]:
Female_Pop = pd.read_csv('../data/Population/Population_(Female_15_44)_2017-2020.csv')
Female_Pop

   Yearly July 1st Estimates  Yearly July 1st Estimates Code  Population
0                       2017                            2017    63862724
1                       2018                            2018    64116950
2                       2019                            2019    64378826
3                       2020                            2020    64543832

In [280]:
Female_Pop['Population'].diff()

0         NaN
1    254226.0
2    261876.0
3    165006.0
Name: Population, dtype: float64

In [281]:
Female_Pop['Diff']= Female_Pop['Population'].diff()

In [282]:
Female_Pop['Pct_change']= round(Female_Pop['Population'].pct_change(),4)
Female_Pop

,Yearly July 1st Estimates,Yearly July 1st Estimates Code,Population,Diff,Pct_change
0,2017,2017,63862724,NaN,NaN
1,2018,2018,64116950,254226.0,0.0040
2,2019,2019,64378826,261876.0,0.0041
3,2020,2020,64543832,165006.0,0.0026

In [283]:
Female_Pop.to_csv('../data/Female_Pop.csv', index = False)